[
    {
        "id": "3139274",
        "author": "MM",
        "recommendation": null,
        "stars": "4/5",
        "content": "Używam od tygodnia. Przyjazny w codziennym użytkowaniu. Wady pewnie wyjdą za pół roku. Windows Phone w porównaniu z Androidem nie zamula, nie wiesza się i nie zacina się. Pewną wadą jest wciąż mała ilość aplikacji na Windowsa. \r\n\nTelefon jest dość duży, więc niełatwo obsługiwać go jedną ręką, wybierając go każdy wie, na co się decyduje.",
        "pros": [
            "szybki system"
        ],
        "cons": [
            "drogie firmowe akcesoria"
        ],
        "upvote": "62",
        "downvote": "17",
        "posted": "2015-05-13 08:58:20",
        "purchased": "2015-05-04 19:55:53"
    },
    {
        "id": "3166800",
        "author": "Tomasz",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefonik sprawuje się bardzo dobrze, ma świetny wyświetlacz, i szybki procesor. Dobrze robi zdjęcia, intuicyjnie, nie trzeba nic ustawiać automat robi swoje. Jest super do przeglądania Internetu z uwagi na dobrze reagujący dotyk. Ciekawa rzecz przy przeglądaniu zdjęć zrobionych aparatem- rejestruje ruch.",
        "pros": [
            "bardzo dobra czerń",
            "doskonała paleta barw"
        ],
        "cons": [],
        "upvote": "98",
        "downvote": "19",
        "posted": "2015-05-29 09:56:37",
        "purchased": "2015-05-12 09:25:45"
    },
    {
        "id": "3445919",
        "author": "Jacek",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Smartfon Lumia 640 LTE użytkuję od niecałych dwóch tygodni, więc nie mam jeszcze wyrobionej pełnej opinii. Jest to mój pierwszy smartfon, więc nie mam też punktu odniesienia. Model ten wybrałem bardzo starannie, porównując dane i opinie dla wielu modeli różnych producentów na , , oraz na innych stronach znalezionych za pomocą wyszukiwarki. Jak dotychczas jestem zadowolony z wyboru. System Windows Phone 8 działa bez zarzutu - płynnie i bez zacięć. Bateria wystarcza mi na 2 doby, a po ustawieniu na tryb oszczędny ponad 4 doby. To oczywiście zależy od stopnia użytkowania smartfona, ale obiektywnie rzecz biorąc deklarowana pojemność baterii jest większa od przeciętnej w innych smartfonach w podobnej cenie. Czytelność ekranu jest bardzo dobra nawet przy minimalnym ustawieniu jasności, a kolorystyka jest przyjemna dla oka. Aparat foto robi ładne zdjęcia z lampą i bez lampy. Przedniego aparatu foto jeszcze nie testowałem. Ten smartfon ma LTE i NFC, co też miało znaczenie przy wyborze. Wcześniej miałem wątpliwości co do wielkości tego modelu - 5 cali wydawało mi się za dużo ze względu na niewygodę w noszeniu go, ale teraz nie chciałbym mniejszego. Minusów nie zauważyłem wiele, chociaż jest kilka - nie wiem tylko, czy wynikają one z obiektywnej niedoskonałości smartfona, czy z mojej niewiedzy w jego obsłudze. Kilka razy musiałem podać ponownie kod karty SIM, ale nie wiem dlaczego; być może karta zgubiła sieć, a może jest to wada tego egzemplarza. W kalendarzu nie można ustawić przypomnienia w dowolnym (niestandardowym) czasie, tylko w podanych interwałach czasowych (np. 15 minut, 30 minut, 1 godzina, itp). W poprzednim telefonie czasem używałem przypomnienia na 2 godziny przed planowanym rozpoczęciem spotkania, a teraz nie mogę tego zrobić. Ponadto, sygnał przypomnienia trwa zbyt krótko - około 5 sekund - i nie jest powtarzany później, a przypomnienie tylko wyświetla się na ekranie. Jeśli więc nie usłyszę sygnału przypomnienia i nie spojrzę na ekran smartfona, to mogę zapomnieć o spotkaniu. Alarm natomiast jest powtarzany wielokrotnie, za każdym razem głośniej, co jest jego niewątpliwą zaletą.",
        "pros": [
            "aparat 8mpx"
        ],
        "cons": [
            "nie można ustawić przypomnienia dowolnie",
            "sygnał przypomnienia trwa zbyt krótko"
        ],
        "upvote": "2",
        "downvote": "0",
        "posted": "2015-11-30 12:36:12",
        "purchased": "2015-11-17 08:03:43"
    },
    {
        "id": "3110244",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Kupiłem telefon Lumia 535 na początku grudnia, sprowadziłem go specjalnie z Francji bo nie mogłem doczekać się wprowadzenia do sprzedaży w Polsce. Kiedy otworzyłem paczkę byłem miło zaskoczony, telefon cienki, dobrze leży w dłoni. Niestety po włączeniu napotkałem(wtedy jeszcze nie było o tym tak wiadomo) globalny problem z digitizerem i wieczne użeranie się żeby system zrozumiał mój \"dotyk\". Męczyłem się do połowy kwietnia 2015r. - męczyłem ponieważ po wielu aktualizacjach które \"miały\" pomóc w działaniu, nie przyniosły żadnego skutku. Telefon sam dzwonił, wysyłały sie sms-y, a gdy już chciałem pokazać komuś zdjęcie to samo się powiększało i zmniejszało. Stwierdziłem koniec męczarni, sprzedaje to \"coś\". Tydzień temu otrzymałem Lumię 640 - do której niestety musiałem dopłacić różnicę w cenach między 535 a 640 LTE - 400 zł. Jestem z niej bardzo zadowolony i w końcu normalnie pracuje mi się na Windowsie. Jest to w sumie mój 5 telefon z Windows Phone (Samsung Ativ S--->Nokia Lumia 1520--->Nokia Lumia 520--->Microsoft Lumia 535--->Microsoft Lumia 640). Z wymienionych najlepszym telefonem okazała się Lumia 1520, niestety jej wielkość uniemożliwiła mi dłuższą pracę i korzystałem z niej tylko miesiąc - żałuję bo sprzęt wyśmienitej jakości. Tyle na temat. Telefon Lumia 640 LTE polecam z ręką na sercu, 535 - omijajcie wielkim łukiem. Pozdrawiam Błażej",
        "pros": [],
        "cons": [],
        "upvote": "51",
        "downvote": "10",
        "posted": "2015-04-25 10:16:23",
        "purchased": null
    },
    {
        "id": "3193988",
        "author": "Andrzej M.",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefon dzięki 1 GB ram chodzi tak samo jak wersja z 512MB ram (porównanie do Lumi 630) -płynnie. W przypadku uruchomienia większej ilości aplikacji Microsoft Lumia 640 przechowuje w pamięci większą ilość aplikacji niż Lumia 630. W przypadku Lumi 630 część aplikacji zostało wznawianych i trzeba było trochę poczekać żeby się znów uruchomiły. Ale polecam jeden i drugi telefon.",
        "pros": [
            "wyświetlacz ips"
        ],
        "cons": [
            "jak do tej pory brak"
        ],
        "upvote": "4",
        "downvote": "1",
        "posted": "2015-06-16 09:47:41",
        "purchased": "2015-05-16 14:00:34"
    },
    {
        "id": "3408804",
        "author": "Anna G-a",
        "recommendation": null,
        "stars": "5/5",
        "content": "Długo się wahałam nad zakupem. 2 lata temu korzystałam z lumi jako aparatu służbowego i nie byłam zadowolona. miał więcej wad niż zalet, zawieszał się, brakowało w nim najprostszych rozwiązań. Skusiłam sie jednak, ponieważ zachwyciłam się jakością zdjęć Lumii 640. Decyzji nie żałuję i nie wrócę już nigdy do androida. Oprogramowanie stabilne, nie zawiesza się, jest bardziej dopracowane niż we wcześniejszych modelach, a do tego tel. robi rewelacyjne zdjęcia :)!! Co prawda aplikacja domyślna do robienia fot jest dość uboga, ale za darmoszkę można ściągnąć sporo dodatków i cieszyć się rewelacyjnym kompaktem. Duży wyświetlacz jest wygodny podczas czytania ebooków, a to dla mnie ogromny plus. Lumia jest moją ulubioną zabawką i stale odkrywam jej możliwości :)",
        "pros": [
            "duży i wygodny wyświetlacz",
            "duży wybór bezpłatnych aplikacji",
            "trzeba",
            "działa sprawnie",
            "nie zawiesza się",
            "intuicyjny",
            "dopracowany soft",
            "wyświetlacz odporny na zadrapania"
        ],
        "cons": [
            "do aparatu potrzebne dodatkowe aplikacje"
        ],
        "upvote": "14",
        "downvote": "2",
        "posted": "2015-11-09 09:41:58",
        "purchased": "2015-10-20 23:23:56"
    },
    {
        "id": "3321857",
        "author": "Łukasz",
        "recommendation": null,
        "stars": "5/5",
        "content": "Jeden z najlepszych telefonów na rynku za te pieniądze. Oferuje to co flagowce za ok 600 zł. Bardzo szybki, ładny i funkcjonalny. Windows Phone optymalizacją i szybkością działania zostawia w tyle Androida nawet na mocnych sprzętach.",
        "pros": [],
        "cons": [],
        "upvote": "16",
        "downvote": "4",
        "posted": "2015-09-15 10:05:24",
        "purchased": "2015-09-10 11:00:44"
    },
    {
        "id": "3237560",
        "author": "Kuba",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefon bez wad. Jeśli ktoś jest niezdecydowany czy przejść z Andorida lub innego systemu na Windows Phone to nie ma się co zastanawiać. Zachęcająca cena i jakość wykonywanych zdjęć powinny przekonać. Bateria trzyma odpowiednio długo. No i rozmawiać też się da :).",
        "pros": [
            "niebieska obudowa"
        ],
        "cons": [],
        "upvote": "50",
        "downvote": "13",
        "posted": "2015-07-16 07:55:47",
        "purchased": "2015-07-06 10:39:00"
    },
    {
        "id": "3557302",
        "author": "prezes",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "witam, używam od kilkunastu dni, i jak na razie nie zaobserwowalem zadnych minusow, produkt naprawde godny polecenia, za te parametry które posiada co do ceny, super wyświetlacz, poprawne szybkie działanie, wygodny w użytkowaniu.",
        "pros": [
            "tylko używać"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-01-29 13:46:15",
        "purchased": "2015-12-27 20:56:38"
    },
    {
        "id": "3188373",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "3,5/5",
        "content": "Nie wiem czy ja jestem jakiś inny ale właśnie kupiłem ten telefon i jest ten sam najważniejszy jak dla mnie mankament , głośnik umieszczony na tylnej obudowie w taki sposób że jak się położy telefon w domu na stole czy biurku to głośnik jest w całości zakryty i ledwo słychać jak ktoś dzwoni. Trzeba telefon kłaść ekranem do doły żeby cokolwiek usłyszeć. Miałem sony xperie j i było to samo, nie słyszałem jak ktoś do mnie dzwonił. Fajnie że phony mają coraz bardziej wypaśne funkcje ale mogliby też czasami pomyśleć nad funkcjami które są podstawowe i najważniejsze. Po za tym minusów jak na razie nie ma :)",
        "pros": [],
        "cons": [],
        "upvote": "17",
        "downvote": "6",
        "posted": "2015-06-12 00:25:37",
        "purchased": null
    },
    {
        "id": "3401292",
        "author": "Tomekk",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Telefonik niczego sobie, Obudowa plastikowa, wyświetlacz bardzo wyraźny. Trzeba zmienić nawyki z Androida, ale to czas zrobi swoje. Trochę irytujące jest wgrywanie swoich plików dźwiękowych - pliki z karty pamięci musiałem zgrać na komputer i wgrać z powrotem do odpowiedniego folderu w telefonie - taka procedura by Microsoft :-). Ale to zapewne z powodu weryfikacji DRM.\r\nNo i Microsoft trochę popłynął z instrukcją obsługi - online :-). Spróbuj czytać instrukcję i jednocześnie stosować się do niej. Ja nie dałem rady, ale to może ja jestem \"jakiś inny\". Po prostu, należy nauczyć się jej na pamięć. \r\nPoza tym, grupowanie w Ustawieniach, jak dla mnie, jest z lekka chaotyczne.",
        "pros": [],
        "cons": [
            "instrukcja online"
        ],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-11-04 13:03:38",
        "purchased": "2015-10-25 22:55:08"
    },
    {
        "id": "3707585",
        "author": "Zbyszek",
        "recommendation": null,
        "stars": "4/5",
        "content": "Wszystko działa płynnie , jednak nie polecam instalowania Windows 10 , działa wolniej aplikacje uruchamiają się wolniej,przycina się, musiałem wrócić do Win.8,1 . Bateria trzyma 1 dzień, to za mało.",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-04-22 09:07:09",
        "purchased": "2016-03-10 11:16:21"
    },
    {
        "id": "3132655",
        "author": "Krzysztof",
        "recommendation": null,
        "stars": "5/5",
        "content": "Produkt zgodny z opisem spełnia swoje wymagania, w przystępnej cenie.",
        "pros": [
            "responsywność",
            "stabilność",
            "wsparcie producenta"
        ],
        "cons": [
            "brak diody informującej o zdarzeniach"
        ],
        "upvote": "15",
        "downvote": "6",
        "posted": "2015-05-08 13:14:59",
        "purchased": "2015-04-08 15:05:55"
    },
    {
        "id": "4850999",
        "author": "Rulezz",
        "recommendation": null,
        "stars": "3,5/5",
        "content": "Telefon jak najbardziej dobrze zrobiony. Wyświetlacz 1080p, aparat z optyką Zeiss, nagrywanie filmów w Full HD (30kl/s). Wszystko fajnie, gdyby nie fakt, że Windows 10. System świetnie przemyślany, prosty, dopracowany pod każdym szczegółem, ale aplikacje na Windowsa - brak. Jak są, to mocno ograniczone. Np. Messenger nie ma wielu funkcji, ktore ma Android. Nie ma typowych aplikacji, bo są dostępne tylko na Android lub IOs, co sprawia, że \"smartfon\", nie jest taki smart. Przewodniki multimedialne, płatności za autostrady, aplikacje muzyczne, fotograficzne czy głupi Gmail - tego nie ma, bo to Windows :/",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-07-14 13:08:08",
        "purchased": "2017-07-09 00:36:16"
    },
    {
        "id": "3557283",
        "author": "prezes",
        "recommendation": null,
        "stars": "5/5",
        "content": "uzywam od kilkunastu dni i jestem mega pod wrazeniem wykonania i samego dzialania telefonu, sprawdzony towar przez inne osoby, polecam na plus.",
        "pros": [
            "tylko kupować i używać",
            "wystarczające parametry"
        ],
        "cons": [
            "jak narazie nie widzę"
        ],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-01-29 13:41:56",
        "purchased": "2015-12-27 20:56:38"
    },
    {
        "id": "3364538",
        "author": "Paweł",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Kupując Lumię przesiadłem się z androida, który na moment zastąpił genialny Blackberry 10. No właśnie. Wybór padł na 640 lte, ponieważ android... sami wiecie, skoro rozważanie zakup telefonu z WM. BB nie kupiłem ze względu na cenę nowych modeli i fakt braku godnego następcy Z10.\r\nCzemu lumia 640 lte? Bo w tym przedziale cenowym nie dostanę nowego aparatu od apple, a po zapoznaniu z telefonem znajomego zauważyłem świetną płynność działania i kilka ciekawych rozwiązań. Poza tym wygląd WM8.1 cieszy oko, a 640 ma dostać aktualizację. Oczywiście Lumia spełnia też moje oczekiwania pod względem użytkowym.\r\n\nZalety. \r\n+ 640 ma rewelacyjny wyświetlacz (dla mnie trochę za duży - wybrałbym nieco mniejszy odpowiednik, gdyby był). Jest czytelny, barwy przyjemne dla oka, czuły dotyk.\r\n+ Nowy WM, w którym uporządkowano ustawienia, choć nie do końca. Korektora dalej trzeba szukać, nie ma możliwości \"dostania\" się do niego z poziomu odtwarzacza. W każdym razie jest lepiej - drażnią cię kafelki? Nie możesz się przestawić - jest przydatna alfabetyczna lista aplikacji.\r\n+ wspomniane kafelki, których nie toleruję na komputerze, w telefonie są nawet przydatne. Mam krótkie palce, więc przy takim ekranie mógłbym mieć problem obsługi jedną ręką. I tutaj jest największy plus tego rozwiązania - w przeciwieństwie do ikon, można je rozciągnąć i już się da. Rozwiązanie połlowiczne, ale działa. Można zmieniać ich barwę, ale dla mnie to mało istotne.\r\n+ Płynność działania - owszem, czasem pojawia się animacja z kropkami, ale krótko i naprawdę nieczęsto.\r\n+ WYGODNA obsługa poczty. Bez ZBĘDNYCH udziwnień, barw itp. Lista tematów, łatwość w odczycie i usuwaniu.\r\n+ pakiet office - otworzysz dokument bez pobierania czytników czy innych programów, które musisz pobrać - tu masz je od razu (jedynie adobe trzeba instalować).\r\n+kilka mało przydatnych, ale funkcjonalnych aplikacji markowanych nazwą lumia (nie ma ich za dużo)\r\n+oneDrive póki co na plus\r\n+ Bateria. Nie udało mi się zmęczyć telefonu w czasie krótszym niż niecałe dwa dni (wifi, internet komórkowy), przeglądarka, zabawa itp.\r\n+ Podobnie nie udało mi się nagrzać telefonu, choć jeszcze nie zdążyłem użyć np. yanosika, który uwalał pod tym względem moje poprzednie aparaty.\r\nNa -\r\n- aparat dobry i nie jednocześnie - brak mu stabilizacji. Można ustawić wiele rzeczy ręcznie. Jakość w słabym oświetleniu ujdzie. Niby dobre zdjęcia, ale Z10 robił lepsze \r\n- Dla fanów słuchania przeszkodą jest brak dostępu do korektora z poziomu odtwarzacza. Jeśli słuchasz muzyki z yt, to przy minimalizowaniu przeglądarki, np. do użycia korektora czy czegokolwiek, dźwięk znika i jeszcze nie znalazłem rozwiązania jeśli takie jest. Sansa Clip+ gra lepiej. Tyle - to subiektywna kwestia.\r\n\nLumia 640, czy w ogóle WMphone to doskonały kompromis, jeśli masz dość androida, a nie stać na iphone. Gdyby Blackberry wypuścił godnego następcę Z10, Lumii nie brałbym pod uwagę, ale tak nie jest i w tym momencie jest doskonałym rozwiązaniem. Nie jest pozbawiona drobnych wad, jak brak kabelka usb (ładowarka nie ma odłączanego kabla - taki mały krok wstecz), ale większość z nas pewnie posiada kilka takich w domu. Ale... jeśli wybierasz się w podróż i będziesz go potrzebować... Z drugiej strony jest OneDrive, bt i inne sposoby przesyłu danych. Dość niefortunne jest też umieszczenie głośniczka z tyłu obudowy - położysz telefon na tapczanie i przy małej głośności, możesz nie usłyszeć. Mnie brakuje też diody powiadamiającej. Jest podgląd z wyświetlacza, ale to nie to samo. Ekran można wzbudzić dwoma tapnięciami, niekoniecznie przyciskiem (dodam że wszystkie stawiają dość duży opór ).\r\n\nreasumując - jeśli nic nie będzie się działo z baterią, telefon nie zacznie się przegrzewać, to zostanie ze mną na dużo dłużej, bo jest przyjazny. Wygoda obsługi poczty nie jest tak dopracowana jak w BB10, ale jest dobrze. Nie ma też niesamowicie przydatnego HUB'a, ale są aktualizowane kafelki i bez problemu zamkniemy otwarte aplikacje, przy czym można też je wyłączać po zakończeniu pracy. Nie ma 15 pulpitów, jest jeden i alternatywna lista. To wszystko w połączeniu z dobrą jakością rozmów działa na duuuuży plus. Nawet Wexplorer działa poprawnie. Co do sklepu - dla mnie nie jest aż tak źle - to czego szukałem jest. Od czasów mojej służbowej 610, tutaj mamy ogromny postę i jestli będzie tak dalej, to Microsoft da radę z przereklamowanym androidem. Bo choć to nie jest telefon klasy premium, to jest to produkt na tyle dopracowany, że w tej cenie nie ma konkurenta i na pewne niedomagania można przymknąć oko",
        "pros": [
            "wm8.1"
        ],
        "cons": [
            "brak stabilizacji w aparacie"
        ],
        "upvote": "5",
        "downvote": "2",
        "posted": "2015-10-13 11:32:23",
        "purchased": null
    },
    {
        "id": "3340707",
        "author": "warriordj",
        "recommendation": null,
        "stars": "5/5",
        "content": "Opinia po ok 2 tygodniach uzytkowania. Nie zawiesza sie chodzi bardzo plynnie. Nawigacja dziala dosyc dobrze bez dostepu do internetu, trzeba jednak zgrac mapy na telefon. Ekran wyrazny, duzy, czuly na dotyk. Aparat niezly, ale zdjecia w nocy nie wychodza rewelacyjnie. Nawigacja jest wielka zaleta tego telefonu, praktycznie moze zastapic profesjonalna nawigacje, nawet za granica. Telefon ma duzo przydatnych opcji (router wifi, udostepnianie internetu po bluetooth), ponadto obsluguje aero i calkiem szybko na nim nawet dziala. Wada jest fakt,iz system operacyjny zajmuje ok 40% pamieci telefonu i tendencja aktualizacji jest rosnaca pod wzgledem zajmowanego miejsca na dysku. Poza tym jestem bardzo zadowolony. A i zasięg jest bardzo dobry, wbrew czytanych przed zakupem negatywnych opinii na ten temat :)",
        "pros": [
            "szybki system"
        ],
        "cons": [
            "system operacyjny zajmuje b. duzo miejsc"
        ],
        "upvote": "3",
        "downvote": "0",
        "posted": "2015-09-26 22:18:50",
        "purchased": null
    },
    {
        "id": "3615733",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Po prawie roku użytkowania mogę napisać dość rzetelną opinię o tym produkcie. Przechodząc z Androida na Windows miałem trochę obaw, ale jak się okazało, niesłusznie. \r\n1. System chodzi naprawdę sprawnie, nawet po 11 miesiącach i kilkunastu zainstalowanych aplikacjach. W Androidzie po tym czasie telefon dość mocno zamulał. W Windowsie tego problemu nie ma. \r\n2. Wyświetlacz bardzo łatwo się jednak palcuje, ale dla mnie to nie wada, bo to chyba występuje w każdym dotykowym urządzeniu. Sam dotyk za to działa świetnie niezależnie od stopnia upalcowania wyświetlacza, a i nasycenie kolorów jest jak dla mnie idealne. Jedyny minus to trochę kiepska jakość w słońcu. \r\n3. Obudowa jest naprawdę wytrzymała. Telefon kilka razy upadł mi na parkiet, raz na chodnik i poza rysami, a także ledwo widocznym pęknięciem z tyłu obudowy, telefon jest cały. Minus to jednak kiepskie spasowanie obudowy, bo po kilku tygodniach użytkowania zauważyłem luzy po naciśnięciu na każdy z rogów. Da się jednak z tym żyć i nie wpływa to w żaden sposób na funkcjonowanie telefonu.\r\n4. Aparat robi bardzo dobre zdjęcia, pod warunkiem dobrego oświetlenia, ale nie jest to lustrzanka, do podstawowych zastosowań w porządku.\r\n5. Zarówno Wifi jak i LTE szybko łapie zasięg i działa bez problemów.\r\nPodsumowując: telefonik jest super, to najlepszy telefon jaki miałem, nie licząc dwóch sony ericssonów sprzed ery smartfonowej, wady oczywiście ta lumia też ma, ale nie są one na tyle wielkie, żeby dyskwalifikować produkt. Przesiadka z Androida była bezbolesna, na Windowsa są wszystkie aplikacje jakie potrzebowałem. Jak ktoś lubi pogrzebać w telefonie to Android będzie dla niego lepszy, ale ja na Androida nieprędko wrócę, jeśli w ogóle. Lumię 640 polecę każdemu, kto chce mieć elegancki i bezproblemowy telefon.",
        "pros": [
            "bardzo dobra jakość i głośność rozmów",
            "system nie zamula"
        ],
        "cons": [
            "kiepskie spasowanie obudowy",
            "wyświetlacz słabo spisuje się w słońcu"
        ],
        "upvote": "3",
        "downvote": "1",
        "posted": "2016-03-02 15:02:59",
        "purchased": null
    },
    {
        "id": "3528659",
        "author": "Piotr",
        "recommendation": null,
        "stars": "4/5",
        "content": "Kolejny produkt z rodziny Lumia. To już nie są telefony typowe Nokia ale dzieci microsoftu naszpikowane nowoczesnym software. Telefon funkcjonalny, dużo mozliwości, szybko działający internet. Mniejszy wybór opcji dla aparatu i kamery ( w porównaniu do lumia 800 np) ale jakość zdjęć czy filmów wcale nie gorsza. To mój trzeci telefon tej marki i jezeli microsoft nie pozostanie w tyle za konkurencją (nie mam na myśli produktów made in korea bo te już dawno są w tyle)to pozostanę przy niej jeszcze długie lata.",
        "pros": [
            "funkcjonalność",
            "jeżeli ktoś nie lubi an",
            "lumia z windows os"
        ],
        "cons": [
            "za duża jak dla mnie"
        ],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-01-12 19:05:49",
        "purchased": "2015-12-21 18:40:42"
    },
    {
        "id": "3247655",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "2/5",
        "content": "Telefon LUMIA 640 LTE użytkowałem 5 dni. Jak dla mnie nie był to udany zakup. Na szczęście miałem możliwość odstąpienia od umowy, z czego skorzystałem.\r\n\nCo było na NIE:\r\n\n- Na początek, po zrobieniu 2 zdjęć przestał działać aparat. Po próbie uruchomienia aparatu wyświetlał się komunikat \" COŚ POSZŁO NIE TAK\". Pomimo zmiany różnych ustawień i zmiany programów do obsługi aparatu i kamery aparat był martwy. Pomógł RESET do ustawień fabrycznych.\r\n\n- często nie można było się do mnie dodzwonić pomimo, że telefon był cały czas w zasięgu sieci i mocy sygnału 70 do 100% (WARSZAWA)\r\nDla dzwoniących do mnie był komunikat telefon niedostępny, a ja otrzymywałem SMSa z informacją o próbie połączenia. Wybierając numer ponownie udawało już się dodzwonić. Kiedy zorientowałem się, że jest coś nie tak zadzwoniłem z drugiego telefonu na LUMIĘ i usłyszałem w słuchawce, że telefon jest niedostępny. Rozłączyłem się i wybrałem numer ponownie. Tym razem było już ok.\r\n\n- Po podłączeniu LUMII do zintegrowanego systemu audio z systemem głośnomówiącym w samochodzie za pomocą bluetooth telefon co chwila zrywał łączność nie pozwalając na wykonanie jakiejkolwiek rozmowy telefonicznej za pomocą zestawu. Dodam, że inne telefon działają poprawnie.\r\n\n- jak dla mnie jest  zupełnie nieczytelna historia połączeń. Przy kilkudziesięciu połączeniach dziennie trudno się połapać. Są tylko opisy tekstowe obok kontaktu typu: połączenie wychodzące, połączenie przychodzące, itp. Przydałyby się może jakieś czytelne najlepiej kolorowe ikonki jak to jest stosowane u innych, albo możliwość posegregowania na dany rodzaj połączeń. Może jest możliwość zainstalowania jakiegoś dodatku ale tego nie sprawdzałem.\r\n\n- zniekształcony nienaturalny głos rozmówcy w słuchawce\r\n\n- dużo możliwości ustawień ale poukrywanych i czasami ciężko znaleźć to co chcemy\r\n\n- pomimo 8GB wewnętrznej pamięci to 4,3 GB mamy zajęte na starcie nasystem\r\n\n\nCo było na TAK.\r\n\n- długi czas działania na baterii\r\n- dobrze i szybko działający bez zacięć system\r\n- dużo możliwości ustawień\r\n- wygodne w użyciu kafelki na pulpicie\r\n- czytelny ekran nawet w słońcu",
        "pros": [
            "szybki system"
        ],
        "cons": [
            "brak diody informującej o zdarzeniach",
            "często nie można się do mnie dodzwonić"
        ],
        "upvote": "21",
        "downvote": "8",
        "posted": "2015-07-22 22:21:17",
        "purchased": null
    },
    {
        "id": "3342038",
        "author": "Dawid",
        "recommendation": null,
        "stars": "5/5",
        "content": "Bardzo dobra. Działa bez zarzutu. Mogła by bateria wytrzymywać troszkę dłuzej. Wielka zaleta jest nawigacja, ktora dziala bez pakietow danych. Polecam serdecznie.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-09-28 12:56:48",
        "purchased": "2015-09-12 15:40:25"
    },
    {
        "id": "3444279",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Mam ten telefon od pewnego czasu i jestem z niego bardzo, ale to bardzo zadowolony. Telefon działa bardzo szybko i stabilnie, aplikacje otwierają się błyskawicznie, a gry, nawet takie jak Asphalt 8 chodzą bez zarzutu. Dodatkowo świetny aparat, nawet przedni spisuje się całkiem nieźle. Windows Phone jest gwarancją, że ten telefon będzie działać tak samo zarówno za rok, jak i za 5 lat. \r\nBardzo ważne jest, by nie porównywać aż tak szczegółowo parametrów Lumii i Androida - mimo teoretycznie gorszych komponentów otrzymujemy lepszy telefon, który nam wystarczy na lata. To najlepszy telefon za tę cenę, jaki można dostać.",
        "pros": [
            "aktualizacja do windows 10",
            "bardzo dobry aparat ze świtetnym trybem",
            "błyskawiczne działanie aplikacji i gier",
            "genialna cena",
            "możliwość rozbudowy pamięci",
            "płynny i stabilny system",
            "szybki system",
            "windows phone - system na lata",
            "zdejmowana tylna klapka",
            "zintegrowane usługi microsoftu"
        ],
        "cons": [
            "duże ramki ekranu"
        ],
        "upvote": "1",
        "downvote": "0",
        "posted": "2015-11-28 21:37:09",
        "purchased": null
    },
    {
        "id": "3240256",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Super telefon. Wielki bardzo wyraźny ekran i co najważniejsze bardzo dobra jakość rozmów i głośników. Póki co, wszystko śmiga bez najmniejszego zająknięcia (po wcześniejszych telefonach z androidem jestem mega zadowolony). Zdjęcia w bardzo dobrej jakości, bateria trzyma całkiem długo jak na taki duży telefon. Wykonanie - bardzo estetyczne.\r\nAle ma też małe wady: brak diody sygnalizującej, że ktoś dzwonił lub pisał. Jest informacja na wyświetlaczu więc da się żyć. A po za tym szkoda, że dalej Windows Phone jest mało popularny i ma jakieś tam braki w aplikacjach. Szkoda bo działa moim zdaniem lepiej od Androidów a może przyjść moment, że przestaną go wspierać przez brak popularności :(\r\n\nPs. polecam również zakupy brandowanych telefonów z Windowsem, bo można zaoszczędzić nawet z 200zł a wszystkie apki od operatora można wyrzucić :) Przynajmniej u mnie się dało\r\n\nJak za nowy telefon z LTE za 490 zł (aledrogo) to mogę tylko zdecydowanie polecać ten telefon !",
        "pros": [],
        "cons": [
            "funkcjonalność"
        ],
        "upvote": "1",
        "downvote": "0",
        "posted": "2015-07-17 20:46:02",
        "purchased": null
    },
    {
        "id": "3674336",
        "author": "rafal",
        "recommendation": null,
        "stars": "5/5",
        "content": "Koniecznie polecam fajny funkcjonalny przejrzysty szybki system bez mulenia z bardzo dobrym aparatem i wysokiej rozdzielczością wyświetlaczem w bardzo konkurencyjnej cenie. Windows phone bije na głowę androida a sam telefon porównując z androidem o tej szybkości działania, wyświetlaczu o takiej rozdzielczości z aparatem o tych megapikselach w androidzie w tej cenie zapnijcie!. Podsumowując. Super system, wygodny, intuicyjny i dobrej jakości aparat i wyświetlacz w dobrej cenie aparatu.",
        "pros": [
            "funkcjonalność",
            "szybki system"
        ],
        "cons": [],
        "upvote": "2",
        "downvote": "0",
        "posted": "2016-04-04 09:41:15",
        "purchased": "2016-03-21 08:41:05"
    },
    {
        "id": "3539112",
        "author": "stanisław",
        "recommendation": null,
        "stars": "5/5",
        "content": "bardzo fajne urządzonko, znakomity aparat przód i tył, bardzo dobra rozdzielczość i czułość ekranu. W tej kategorii cenowej absolutny hicior.",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "0",
        "posted": "2016-01-18 23:04:34",
        "purchased": "2015-11-29 20:59:19"
    },
    {
        "id": "3884052",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Polecam dla osób które będą go używać głównie jako telefonu... ewentualnie aparatu, a funkcje smart jako dodatek - od czasu do czasu... Jeżeli wyłączy się WiFi i zegarek który długi czas świeci ekranem (ja noszę zwykły zegarek na ręku więc ten z telefonu jest mi zbędny), a przy tym jeszcze odrobinę ograniczy podświetlanie ekranu to czas pracy na baterii zaczyna przekraczać tydzień czasu mimo iż codziennie prowadzone są krótkie rozmowy telefoniczne... telefon w rzeczywistości wygląda lepiej niż na zdjęciach - działa płynnie - nie zacina się. Ekran bardzo wyraźny. Dotyk działa jak powinien - wpisanie 4-cyforwego kodu odblokowującego telefon zajmuje 2 sekundy. Skonfigurowanie ekranu startowego pod siebie nie powoduje żadnych problemów... mała popularność Windowsa Mobile niesie ze sobą pewną zaletę - jest mniej narażony na wirusy i ataki co w dobie elektronicznej bankowości jest bezcenne, choć i niesie też pewną wadę - aplikacji jest mniej niż na androida...",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-08-16 14:19:12",
        "purchased": null
    },
    {
        "id": "3186722",
        "author": "Yoshi_970",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefon bardzo fajny glośnik bardzo dobry jak na taki telefon aparat dobry a ekran rewelacyjny ma świetną czerń godny polecenia !!!!!!!!!!!!!!!!!!!!!!!!!!!!",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "2",
        "posted": "2015-06-11 00:17:24",
        "purchased": "2015-05-11 18:57:11"
    },
    {
        "id": "3553586",
        "author": "Maciej",
        "recommendation": null,
        "stars": "5/5",
        "content": "Super sprzęt, mój 71 letni tata potrafi go bez problemu obsłużyć a jest to jego pierwszy dotykowy telefon. Polecam",
        "pros": [],
        "cons": [],
        "upvote": "2",
        "downvote": "0",
        "posted": "2016-01-27 12:46:07",
        "purchased": "2016-01-07 21:34:39"
    },
    {
        "id": "3194009",
        "author": "Andrzej M.",
        "recommendation": null,
        "stars": "5/5",
        "content": "To mój drugi zakup telefonu - tym razem dla siebie. Polecam",
        "pros": [],
        "cons": [
            "na razie brak"
        ],
        "upvote": "4",
        "downvote": "3",
        "posted": "2015-06-16 09:51:54",
        "purchased": "2015-05-17 12:48:38"
    },
    {
        "id": "3291540",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Telefonu używam 1,5 miesiąca. Po przejściu z androida ogromna zmiana na plus. Ładny wyświetlacz ,odwzorowanie kolorów bardzo dobre(zwłaszcza czerń).Telefon smukły i cienki. Nie przycina się ,Asphalt 8 -działa bez problemu. Mam wersję czarny mat, dokupiłem kartę 32GB.Internet szybki ,po ok.4godzinach i kilku telefonach mam na wieczór ok. 60% bat. Wszystkie  potrzebne okienka mam \"pod palcem\",są trzy rozmiary. Jedynie co mnie denerwuje to, że przyciski na prawej ramce są dla mnie ciut za wysoko.Zdjęcia b.dobre  jak na 8MPa. Najlepszy smartfon w cenie do 1tyś.Szczerze polecam",
        "pros": [],
        "cons": [],
        "upvote": "3",
        "downvote": "0",
        "posted": "2015-08-24 20:22:30",
        "purchased": null
    },
    {
        "id": "3303031",
        "author": "Jordan",
        "recommendation": null,
        "stars": "5/5",
        "content": "Mój pierwszy smartphone. Powiem tak: na pierwszy rzut oka robi wrażenie. Design jest na prawdę elegancki choć zarazem nowoczesny; to połączenie bardzo przypadło mi do gustu. Aparat nie nadzwyczajny aczkolwiek bardzo bardzo dobry; 8mp robi swoje. Telefon pracuje bez zarzutów, jednak ma niefajną tendencję do \"powrotu\" do kafelek gdy otwiera się zbyt dużą stronkę lub apke, po poszerzeniu pamięci problem znikł. ;) Telefon ma dużo inteligentnych rozwiązań o których sami się przekonacie. Stosunek jakość - cena zasługuje na sześć z plusem. Polecam (szczególnie wersję niebieską)! Microsoft spisał się na medal.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-09-01 21:31:44",
        "purchased": null
    },
    {
        "id": "3769604",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Poprzednio miałem Lumię 620 (Nokia), która mnie mocno irytowała. Pomimo tego zdecydowałem się na Lumię 640 pod marką Microsoftu. Zakup okazał się pomyślny. Urządzenie jest w pełni funkcjonalne i ergonomiczne. System działa bez zarzutu i jest stabilny. Bardzo dobra nawigacja, skuteczny backup danych w chmurze, użyteczny pakiet Office. Pomimo zastosowanego w obudowie plastiku, jego jakość jest zadowalająca. Telefon z klasą za niewielkie pieniądze.",
        "pros": [
            "funkcjonalność",
            "świetna nawigacja"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-06-03 07:01:22",
        "purchased": "2016-05-23 18:47:03"
    },
    {
        "id": "3109429",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefon jest świetny, ekran 5\" z powłoką clear black robi wrażenie. Bateria jeśli sie sporo używa starcza na dwa dni. Pięknie wykonana ale żałuje że nie wziąłem niebieskiej. Aparat dobry, do robienia zdj okazjonalnych ok. No i windows 8.1 działa wyśmienicie. Za tą cene nie widze lepszego smartfona.",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "26",
        "downvote": "5",
        "posted": "2015-04-24 20:41:55",
        "purchased": null
    },
    {
        "id": "3143071",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Miałam wczesniej samsunga ace 2. Szczerze, lumia jest o 1000 razy lepsza. Jestem bardzo zadowolona z tego telefonu. Aparat robi bardzo ladne zdjecia, glosno gra, wyglad telefonu, ekran. Wszystko super. Dodatkowo kupujac telefon dostalam rok office za darmo i jakies minuty na skype. Same plusy. Na prawde polecam :))",
        "pros": [
            "funkcjonalność",
            "szybki system"
        ],
        "cons": [],
        "upvote": "20",
        "downvote": "1",
        "posted": "2015-05-15 08:57:53",
        "purchased": null
    },
    {
        "id": "4298729",
        "author": "lucyna",
        "recommendation": null,
        "stars": "5/5",
        "content": "wczesniej mialam iPhone...teraz za namowa mojej corki zdecydowalam sie na Microsoft Lumia...narazie ucze sie obslugi ale ogolnie jestem zadowolona...sliczny,nowoczesny wyglad (a to dla mnie tez jest wazne) poza tym pelni dla mnie role dodatkowa jako MP3...\r\nPo internecie surfuje bez problemow , o grach nie moge nic powiedziec bo nie gram...Robiac zdjecia tez mozna sie \"pobawic\" przy obrobce.... jestem zadowolona...to co jest mi potrzebne \"w jednym\" to mam.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-12-20 12:28:58",
        "purchased": "2016-12-13 17:45:10"
    },
    {
        "id": "3248737",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "3,5/5",
        "content": "Miałem ten telefon przez miesiąc. Pierwszy telefon do którego nie miałem wogóle szczęścia. Po pierwsze spadł mi z wysokości kolan ( leżał między nogami jak siedziałem) i pękła zewnętrzna obudowa wyświetlacza. Gdyby krawędzie były oddalone od wyświetlacza to może by się nic nie stało. Dla mnie to porażka, porażka i jeszcz raz porażka. Przecież wiedzą producenci że każdemu zdarzy się przypadkowe upadnięcie telefonu i trzeba działać zapobiegawczo. Wcześniejsze modele były wytrzymalsze a teraz celowo się robi z telefonów delikatne badziwia żeby naciągać na nowy wyświetlacz za 200 zł. Wcześniej miałem HTC-eka z wyświetlaczem dotykowym, leciał nie raz i nie było tego problemu. Celowo projektuje się żeby się psuły. NOKII w życiu już nie kupię i to będzie moja zemsta. W przyszłości każdy będzie wiedział co miałem na myśli, prędzej czy później. I będzie tak samo zły na producenta.",
        "pros": [
            "mapa bez  połączenia z intrenetem",
            "zdjęcia w porzadku jak za to cenę"
        ],
        "cons": [
            "zbyt delikatny"
        ],
        "upvote": "1",
        "downvote": "11",
        "posted": "2015-07-23 13:07:22",
        "purchased": null
    },
    {
        "id": "4576690",
        "author": "Jacek",
        "recommendation": null,
        "stars": "4/5",
        "content": "Po dwóch latach uzytkowania, wciąz działa. Polecam",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-04-17 11:50:40",
        "purchased": null
    },
    {
        "id": "3618175",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "3/5",
        "content": "Mam telefon pół roku. Wcześniej miałam jakieś 4 telefony na androidzie, postanowilam spróbować czegoś nowego. Wiem, że nigdy już nie będę chciała Windowsa, bo posiada połowę mniej rzeczy które można robić na androidzie. Jeżeli ktoś był przyczajony to może być ciezko przejść na Windowsa. Zawsze z telefonem i funkcjami zapoznawałam się max godzinę. Tu, żeby wiedzieć co gdzie i jak potrzebowałam chyba miesiąc, chociaż są rzeczy których nie wiem do teraz. Jest naprawdę trudnym systemem. Najbardziej przeszkadza mi, że nie mogę zmienić sposobu pisania SMS-ów(nienawidzę QWERTY). Ale ma też dużo zalet, ponieważ nigdy mi się jeszcze nie zawiesił, robi fajne zdjęcia, fajnie się prezentuje. Zaliczył porządny upadek(wypadł mi podczas biegu na betonie i leciał ekranem po ziemi ) i ma tylko obudowę na bokach stratą, a ekran cały(ale wolę już nie ryzykować i kupilam szkło haftowane i etui-polecam na 100%). Ogólnie telefon nawet fajny, ale jest dosyć trudny. Jest mi ciężko stwierdzić czy polecam czy nie.",
        "pros": [
            "szybki system"
        ],
        "cons": [
            "mało dostępnych aplikacji",
            "za duża jak dla mnie"
        ],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-03-03 12:46:09",
        "purchased": null
    },
    {
        "id": "3759869",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "1/5",
        "content": "Zanim wybrałam Lumie 640 szukałam opinii, ale niestety nie trafiłam na dyskusje o samoczynnych resetach. Po tygodniu użytkowania telefon trafił na serwis z powodu samoczynnego wyłączania się i żądania PINu. Telefon (nowy z salonu, oczywiście na gwarancji) wyłącza się po kilkanaście razy dziennie. Pierwsze 2 tygodnie w serwisie i aktualizacja oprogramowania nie pomogły - nadal to samo. Potem kolejne 3 tygodnie w serwisie, aktualizacja oprogramowania (jaki serwis potrzebuje 3 tyg.na aktualizację oprogramowania?!) i nadal to samo. Nic nie zostało naprawione. I teraz kolejny zwrot. I co z tego, że telefon jest na gwarancji, że nowy, skoro i tak nie można z niego normalnie korzystać?! Dno.... Radzę wszystkim wybrać coś sprawdzonego, a nie MS Lumia. Wcześniej miałam Lumia 520 - telefon świetny, ale to jeszcze była NOKIA. Wszystkim zastanawiającym się nad wyborem telefonu szczerze odradzam Lumie 640 - oszczędźcie sobie nerwów.",
        "pros": [],
        "cons": [
            "sam się resetuje"
        ],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-05-26 13:34:35",
        "purchased": null
    },
    {
        "id": "3432982",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "2,5/5",
        "content": "Telefon średni. Nie można się przyczepić do szybkości działania. To mój pierwszy tel. z Windows Phone. Bateria trzyma 2-4 dni. Zdruzgotany jestem natomiast jakością zdjęć. Aparat a poziomie telefonów za 3 stówki z marketu. Obraz podczas kadrowania jest jak najbardziej prawidłowy. Dużo ustawień manualnych itp, Natomiast zdjęcie w ogóle nie przypomina tego obrazu, który oglądamy podczas jego wykonywania! Wyprane, bez szczegółów. Najgorszy z tego wszystkiego jest kolor ludzkiej skóry. Co ciekawe video nagrywane w tych samych warunkach oświetleniowych wychodzi zdecydowanie lepiej. Moim zdaniem problemem jest tu jakiś drastyczny proces np. odszumiania. Zdjęcie wykonane aparatem nawet wstyd jest wysłać mmsem.",
        "pros": [
            "szybki system"
        ],
        "cons": [
            "doskonała paleta barw",
            "funkcjonalność"
        ],
        "upvote": "0",
        "downvote": "1",
        "posted": "2015-11-23 09:26:10",
        "purchased": null
    },
    {
        "id": "3437745",
        "author": "marillion5",
        "recommendation": null,
        "stars": "5/5",
        "content": "smartfon ok, zgodny z opisem",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "0",
        "posted": "2015-11-25 10:25:09",
        "purchased": "2015-10-16 19:03:56"
    },
    {
        "id": "3245951",
        "author": "Bolecki1981",
        "recommendation": null,
        "stars": "5/5",
        "content": "LTE,Windows Phone 8.1 i przystepny cenowo ;)",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "3",
        "posted": "2015-07-22 10:36:16",
        "purchased": "2015-07-15 12:08:29"
    },
    {
        "id": "3608847",
        "author": "arca",
        "recommendation": null,
        "stars": "5/5",
        "content": "W tej cenie bezkonkurencyjna.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-02-28 13:24:20",
        "purchased": "2016-01-10 19:17:16"
    },
    {
        "id": "3800424",
        "author": "zadowolony",
        "recommendation": null,
        "stars": "5/5",
        "content": "świetny smartfon w tej klasie cenowej",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-06-28 12:22:05",
        "purchased": "2016-06-22 12:26:27"
    },
    {
        "id": "11401927",
        "author": "Kamil",
        "recommendation": null,
        "stars": "5/5",
        "content": "telefon trudny w obsłudze",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2019-12-10 17:05:27",
        "purchased": "2019-11-13 11:34:17"
    },
    {
        "id": "3101690",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Jestem pod olbrzymim wrażeniem tego telefonu. Używany BARDZO intensywnie - nie robię nim jedynie zdjęć, bo ich w ogóle nie robię -  dwie karty SIM cały czas i dotąd nie zdołałem wykończyć baterii w mniej niż dwa dni. Jestem też zachwycony faktem dołączenia połączeń z dwóch numerów telefonicznych w zestawie głośnomówiącym w samochodzie. A gdy telefon mi upadł, wytrzymał to godnie. Tylna obudowa nieco porysowana, ale tę łatwo wymienić.\r\nIstotne funkcje są, działają sprawnie. Na WinPhone jest najlepsze sudoku, Jappi. \r\n\nPolecam ten telefon z najczystszym sumieniem.",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "33",
        "downvote": "3",
        "posted": "2015-04-21 07:25:18",
        "purchased": null
    },
    {
        "id": "3194776",
        "author": "Artur",
        "recommendation": null,
        "stars": "4/5",
        "content": "Fajna komórka",
        "pros": [],
        "cons": [],
        "upvote": "3",
        "downvote": "3",
        "posted": "2015-06-16 14:28:00",
        "purchased": "2015-05-15 09:58:26"
    },
    {
        "id": "3562621",
        "author": "AnnaK",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Spełnia oczekiwania",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-02-02 11:23:45",
        "purchased": "2016-01-28 14:12:20"
    },
    {
        "id": "3674074",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4/5",
        "content": "zrabny",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-04-04 07:01:41",
        "purchased": "2016-02-14 19:28:39"
    },
    {
        "id": "3219810",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "1/5",
        "content": "Telefon byłby ok, gdyby nie fakt, że gubi sieć - po jakimś czasie na czuwaniu samoczynnie wylogowuje kartę SIM z sieci i aby zadzwonić trzeba wklepać PIN - i tak kilkanaście razy w ciągu dnia. Oczywiście nikt w tym czasie nie może się na telefon dodzwonić. Znany sklep po złożeniu reklamacji stwierdził, że telefon jest sprawny (sic!) i zgodny ze specyfikacją. Ciekawe, skoro nie spełnia podstawowej funkcji - czyli nie można się dodzwonić na ten telefon. Odradzam zakup, bo z tego co piszą w sieci problem dotyczy złych portów SIM i jest dość powszechny.",
        "pros": [],
        "cons": [],
        "upvote": "11",
        "downvote": "7",
        "posted": "2015-07-03 09:17:33",
        "purchased": null
    },
    {
        "id": "3707267",
        "author": "PawelDudzic",
        "recommendation": null,
        "stars": "5/5",
        "content": "super telefon",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-04-21 22:05:38",
        "purchased": "2016-04-08 16:35:38"
    },
    {
        "id": "3367837",
        "author": "Lesio",
        "recommendation": null,
        "stars": "5/5",
        "content": "Smartfon godny uwagi. Obsługa mile zaskakuje. Ogarnięcie Windows Phone'a przez nowicjusza nie jest skomplikowana. Jedyny minus to fakt, iż po wyjęciu z pudełka i włożeniu karty sim trzeba jeszcze trochę odczekać aż Windows się zaktualizuje, skonfiguruje itd. A to oznacza kilka restartów urządzenia. Później to już bajka. Brakuje też niektórych aplikacji znanych z andka, ale można znaleźć alternatywy.",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "1",
        "posted": "2015-10-15 10:01:21",
        "purchased": "2015-09-15 11:43:35"
    },
    {
        "id": "3226325",
        "author": "Ewa",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Telefon jest bardzo dobry, jak na razie nie mam większych zarzutów. Jest trochę za duży jak dla mnie, ale mimo wszystko poręczny :) Chodzi ładnie, nie zawiesza się, a to dla mnie było b.ważne po poprzednim telefonie. Robi świetne zdjęcia, nawet w słabym świetle. Przednia kamerka też zadowalająca. Ogólnie jestem bardzo zadowolona :)",
        "pros": [
            "b. dobry głośnik",
            "zdjęcia dobrej jakości"
        ],
        "cons": [
            "często nie można się do mnie dodzwonić",
            "problem z odbiorem zdjęć przez bluetooth"
        ],
        "upvote": "1",
        "downvote": "0",
        "posted": "2015-07-07 19:39:59",
        "purchased": "2015-06-08 16:46:45"
    },
    {
        "id": "3382999",
        "author": "olofasolo",
        "recommendation": null,
        "stars": "5/5",
        "content": ":)",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2015-10-26 12:53:25",
        "purchased": "2015-10-06 14:19:40"
    },
    {
        "id": "3305426",
        "author": "Wiktor",
        "recommendation": null,
        "stars": "5/5",
        "content": "Super telefon. Posiada szybkę której praktycznie nie da się zarysować, a ponadto nie ścina się tak jak androidy.Jedyną wadą jaką zauważyłem jest konieczność zakładanie konta microsoft (co nie jest wcale proste) żeby pobierać aplikacje.\r\nPolecam, najlepszy telefon w tej cenie.",
        "pros": [],
        "cons": [],
        "upvote": "14",
        "downvote": "5",
        "posted": "2015-09-03 10:49:47",
        "purchased": "2015-08-14 12:57:18"
    },
    {
        "id": "3344393",
        "author": "Tomasz",
        "recommendation": null,
        "stars": "5/5",
        "content": "Zamieniłem 535 Dual Sim na 640 LTE . Przyczyny: lepsza jakość zdjęć i filmów, stabilna nawigacja (która widzi nawet chińskie satelity), kompas i inne gadżety. Lumia 640 LTE ma wszystkie zalety dawnej Lumii 800 bez jej wad (niewymiennej baterii, braku slotu na kartę pamięci). Za cenę trochę ponad 600 zł zyskujemy szybki, stabilny system Windows Phone 8.1 (niedługo aktualizacja do Windows 10), dobry stabilny GPS i szybkość LTE. Czy potrzeba czegoś więcej?",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-09-30 00:00:02",
        "purchased": null
    },
    {
        "id": "3638479",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefon mam od 5 miesięcy powiem tak na poczatku przejście w z androida na Windows bylo ciężko ale szybko poszło a teraz wiem ze to najlepszy tel jak miałam. Nie wiesza sie jakość rozmów jest bardzo dobra najlepsza. Windows jest calkiem calkiem nie gram a wiec nie jestem wymagajca. Bateria trzyma dwa dni non stop na necie . Ltg cos pięknego. Wiem na peno następny mój telefon to będzie Lumia albo Nokia",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "1",
        "downvote": "1",
        "posted": "2016-03-12 22:49:48",
        "purchased": null
    },
    {
        "id": "7820822",
        "author": "Julia",
        "recommendation": null,
        "stars": "1/5",
        "content": "Ten telefon to dno! Nie polecam  NIKOMU kto chce robić na nim co kolwiek innego niż dzwonić... nie posiada najpopularniejszych i znanych aplikacji typu you tube, snap chat, instagram i wiele innych. Messenger oczywiście nie działa a aparat nie robi zdjęć kiedy ma je zrobić. Nagrywałam ostatnio trochę filmów i co? nagrywa po swojemu: beznadziejna jakość, spowolnione tempo jakby było to przerobione i celowo zwolnione tempo. W ogóle system zżera ponad połowę pamięci -_- jedyną zaletą jest cena ale uważam że to i tak za dużo jak na to coś. Ostatnio to nawet jak chcę zobaczyć jak wyszedł filmik to mnie nie wpuszcza. Muszę za każdym razem rozpierniczać ten telefon o tak: zdejmuję klapę, wyjmuję baterię, wkładam baterię, zakładam klapę i włączam telefon. A i na dodatek jak chcecie aby był wyciszony np. lekcje są czy coś to nie ma dobrze bo trzeba go i wyciszyć i wyłączyć bo sam się włączy o-O z całego serca NIE polecam :) ja muszę wytrzymać z tym jeszcze około rok jak dobrze pójdzie a mam go z 4 lata pewnie tak",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2018-04-09 18:23:33",
        "purchased": null
    },
    {
        "id": "8333696",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "2/5",
        "content": "Telefon używam 2 lata. Wg mnie jest Ok, nie zawiesza się działa poprawnie i ma niezły aparat, ale już jest bezużyteczny z racji, że ma system Windows. Straciłem możliwość korzystania z podstawowych dla mnie aplikacji: OTOMOTO, ALLEGRO, OLX, PAYBACK, YOUTUBE, MBANK, HereMaps. FACEBOOK. Dziś to już tylko może być zabawką dla dzieci bo pozostało jeszcze trochę gierek w sklepie. Dla osoby dorosłej nie spełnia już podstawowych założeń smartfona - brak użytecznych aplikacji. Niestety idzie w odstawkę, dam dzieciom, żeby się bawiły. Szkoda, że WindowsPhone już umiera...",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2018-09-11 07:19:59",
        "purchased": null
    },
    {
        "id": "3293805",
        "author": "Jakub",
        "recommendation": null,
        "stars": "2,5/5",
        "content": "Wady: Położona na płasko  ma bardzo wytłumiony dźwięk dzwonka pomimo maksymalnej głośności, by nie przegapić połączenia  lepiej kłaść szkłem do blatu. Podczas słuchania  radia przez głośniki dzwonek  połączeń jest puszczony przez słuchawki które robią w tedy tylko za antenkę, gdzie tu sens i logika? Brak diody powiadomień i bardzo słabe wibracje. Dotyk gorzej działa niż w lumi 520, często  trzeba powtórzyć  nacisk i to pomimo dużego i gładkiego  ekranu. Pliki ściągnięte przez IE nie lądują w żadnym folderze, normalnie ambafatima było i nima.  Luźna  bateria wypada odrazu po ściągnięciu klapki. Urządzenie nie warte  ceny sugerowanej i nie bez powodu sprzedawane na allegro za 200zł mniej.",
        "pros": [],
        "cons": [],
        "upvote": "2",
        "downvote": "6",
        "posted": "2015-08-26 07:36:36",
        "purchased": null
    },
    {
        "id": "3466731",
        "author": "Jędrek",
        "recommendation": null,
        "stars": "5/5",
        "content": "Praca urządzenia bardzo płynna. Wszystko chodzi jak powinno. Głos rozmówcy podczas rozmowy wyraźny i głośny. Dzwonki głośne. Ekran wyraźny z dobrymi kolorami. Bateria bez problemu wytrzymuje 2 dni przy normalnej eksploatacji. Aparat robi zupełnie przyzwoite zdjęcia. \r\nSzczerze polecam",
        "pros": [],
        "cons": [],
        "upvote": "5",
        "downvote": "0",
        "posted": "2015-12-10 14:10:13",
        "purchased": "2015-11-22 18:44:38"
    },
    {
        "id": "3176758",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Ładny , zgrabny telefon z systemem windows . Urządzenie pracuje  płynnie .\r\n Plus za wymienną baterię . Używam go krótko , na razie bez istotnych zastrzeżeń .",
        "pros": [],
        "cons": [],
        "upvote": "19",
        "downvote": "2",
        "posted": "2015-06-04 09:21:09",
        "purchased": "2015-05-27 22:58:11"
    },
    {
        "id": "3181921",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "po przesiadce z androida (xperia p) mogę spokojnie polecić ten telefon. fajny ekran, dobry aparat i sporo ciekawych aplikacji w sklepie. jeżeli chodzi o gry to nie wypowiem się bo nie gram. na razie raz udało mi się go zawiesić ( instalowałem ze sklepu 18 aplikacji równocześnie) ale tego chyba żaden telefon by nie wytrzymał.",
        "pros": [],
        "cons": [],
        "upvote": "11",
        "downvote": "2",
        "posted": "2015-06-08 14:02:22",
        "purchased": null
    },
    {
        "id": "3318964",
        "author": "Piotr",
        "recommendation": null,
        "stars": "5/5",
        "content": "to już moja druga Lumia (wczeęsniejsza 625) i jestem bardzo zadowolony. Windows Phone jest szybki, stabilny i bardzo intuicyjny. Telefon o bardzo ładnym dizajnie i dobrze wykonany. 5 cali to dobry balans między funkcjonalnością a wygodą używania. Przyciski systemowe przeniesione na ekran (tu miałem największe wątpliwości) spisują się ok - na szczęście w każdej chwili można je ukryć. Za tą cenę nie ma lepszej alternatywy.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-09-12 19:51:27",
        "purchased": null
    },
    {
        "id": "3248601",
        "author": "PAWLOS 72",
        "recommendation": null,
        "stars": "5/5",
        "content": "Sprzęt o wielkich możliwościach. Intuicyjny interfejs. Poręczny zarówno w posługiwaniu się internetem oraz posługiwaniu się obrazem i dźwiękiem. Także możliwości zastosowania różnych aplikacji (w tym gry dla dzieci) sprawiają, że telefon ten jest naprawdę uniwersalny.",
        "pros": [
            "prosta i logiczna obsłługa"
        ],
        "cons": [
            "jeszcze nie znalazłem"
        ],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-07-23 11:52:05",
        "purchased": "2015-07-04 12:01:42"
    },
    {
        "id": "3176616",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Posiadam telefon od dwóch tygodni, jestem bardzo zadowolony. Po pierwsze wygląd robi wrażenie i podoba mi się ten telefon. Telefon mieści się w ręce i można nawet jedną ręką go obsługiwać. Po drugie bateria, jestem bardzo zadowolony z niej, ponieważ trzyma 3-4 dni przy dość częstym użytkowaniu, głównie internet. Jeśli chodzi o funkcjonalność, też bardzo wielki plus tego telefonu. Jedynym minusem jest dość mało aplikacji na windows phone(niektóre w ogóle się nie nadają), ale pomału jest coraz lepiej i mam nadzieję, że to dopracują. Mi to akurat nie przeszkadza. Telefon płynnie chodzi, żadne aplikacje nie sprawiają mu problemów. Dotyk bardzo wrażliwy, co mi bardzo odpowiada, bo jest skuteczny nie trzeba mocno naciskać. Ekran IPS, najlepsza rzecz w tym telefonie, nawet w wielkim słońcu ekran widoczny i można problemu z niego korzystać. Nie ma jak na razie rzeczy do której mógłbym się przyczepić oprócz aplikacji, jestem jak najbardziej zadowolony z zakupu i polecam go każdemu kto ceni sobie funkcjonalność, wygląd, dobry ekran, czuły dotyk bez przycięć i czas pracy na baterii. Pozdrawiam Marcin.",
        "pros": [],
        "cons": [],
        "upvote": "21",
        "downvote": "0",
        "posted": "2015-06-04 00:15:14",
        "purchased": null
    },
    {
        "id": "3443459",
        "author": "Rafał",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefon polecam szczególnie dla tych którzy preferują 2 karty sim. Aero działa bez problemu. Telefon sie nie wiesza dobra jakość wyświetlacza. Niewiem jak z wytrzymałościa bo telefon posiadam 2 miesiące.",
        "pros": [
            "2 karty",
            "sprawny"
        ],
        "cons": [],
        "upvote": "4",
        "downvote": "0",
        "posted": "2015-11-27 23:01:25",
        "purchased": "2015-10-25 19:45:34"
    },
    {
        "id": "3849955",
        "author": "Krzysztof",
        "recommendation": null,
        "stars": "5/5",
        "content": "Kolejny telefon z systemem Windows i zadowolenia ciąg dalszy. Telefon służy do codziennej pracy i spełnia swoją rolę doskonale. Nie spodziewałem się po tym telefonie cudów, jednak pozytywnie mnie zaskoczył jak na swoją cenę. Polecam",
        "pros": [
            "funkcjonalność",
            "szybki system"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-07-28 22:17:24",
        "purchased": "2016-06-26 17:21:27"
    },
    {
        "id": "3202602",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "2,5/5",
        "content": "Ogólnie OK pod warunkiem że nie musicie słyszeć jak ktoś do was dzwoni, gdy telefon leży na stole dzięki temu że głośnik jest na tylnej obudowie prawie nic nie słychać. Fajnie są projektowane dzisiejsze telefony które mają super aplikacje, synchronizacje ale nie potrafią zapewnić podstawowej funkcjonalności jaką jest to żeby odebrać jak ktoś dzwoni. Teraz moje pytanie mam kłaść specjalnie telefon szybką do stołu żeby słyszeć telefon ??? Bzdura",
        "pros": [],
        "cons": [],
        "upvote": "12",
        "downvote": "9",
        "posted": "2015-06-22 18:17:36",
        "purchased": null
    },
    {
        "id": "4405819",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "2,5/5",
        "content": "Nie polecam nastolatkom i osobom które chcą mieć fajne apki typu: Snapchat. Ja niestety zakupiłam go nie całe 2 lata temu i nie jestem zadowolona. Zwiódł mnie jego kolor a dzisiaj bardzo żałuje że go kupiłam. Nie ma podstawowych aplikacji, dziwię się że w ogóle dali fb... W tym telefonie jest nawet trudność w ustawieniu sobie swojego dzwonka. Polecam ten telefon osobom które nie oczekują dużo od telefonu i lubią proste działanie jednak nastolatkom już nie.",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "0",
        "posted": "2017-02-04 21:31:57",
        "purchased": null
    },
    {
        "id": "3198642",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4/5",
        "content": "Microsoft 640 ma wiele zalet, jak choćby wygląd, płynność działania, solidność wykonania, ale ma też jedną zasadniczą wadę - bardo słaby odbiornik WIFI, co powoduje, iż nawet na niewielką odległość telefon ma problem z komunikowaniem się z routerem.",
        "pros": [],
        "cons": [],
        "upvote": "11",
        "downvote": "0",
        "posted": "2015-06-18 20:50:00",
        "purchased": null
    },
    {
        "id": "4294647",
        "author": "JUSTYNA",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefonik niespodzianka dla męża, ale z tego co widzę zadowolony. W porównaniu z 650 wydaje mi się na obecną chwilę lepszy. Czas pokaże co będzie dalej. Dla normalnych użytkowników telefonów bardzo wytrzymała bateria mimo dużego wyświetlacza.",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "0",
        "posted": "2016-12-18 18:06:39",
        "purchased": "2016-12-06 21:18:01"
    },
    {
        "id": "8928439",
        "author": "kerad271",
        "recommendation": null,
        "stars": "5/5",
        "content": "Jak dla mnie -dalej w użyciu po 3 latach,i jest wystarczający\r\nSa lepsze aparaty,telefony ale,.,co tam.,moja dwuletnia corka testuje go codziennie ,upadł już ze 100 razy na podłogę i .,.,działa.,.,dzięki etui zapewne,,.czasem się zwiesi.,.,ale i tak ok,.Dwa razy zmienione szklo hartowane i tyle.,.,",
        "pros": [
            "funkcjonalność",
            "wygląd"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2019-01-15 12:02:07",
        "purchased": null
    },
    {
        "id": "6623502",
        "author": "Angelika",
        "recommendation": null,
        "stars": "5/5",
        "content": "Świetny telefon, za niską cenę. Po latach przekonałam się do windows phone- moje poprzednie doświadczenie z ominą 2- masakra, mulił się  strasznie. W lumii wszystko działa płynnie, szybko, aparat jest świetny - do teraz korzystam do robienia zdjęć produktów ;-) Niestety ekran pęka w pajeczynke ;-)",
        "pros": [
            "bardzo dobra jakość i głośność rozmów",
            "błyskawiczne działanie aplikacji i gier",
            "czas pracy na baterii",
            "duży i wygodny wyświetlacz",
            "funkcjonalność",
            "genialna cena",
            "intuicyjny",
            "dopracowany soft",
            "łatwość obsługi",
            "płynny i stabilny system",
            "system nie zamula",
            "szybki system",
            "wygląd",
            "zdjęcia dobrej jakości"
        ],
        "cons": [
            "brak diody informującej o zdarzeniach"
        ],
        "upvote": "0",
        "downvote": "0",
        "posted": "2018-02-21 20:01:00",
        "purchased": null
    },
    {
        "id": "3360478",
        "author": "Rafał",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Świetny telefon. Przesiadłem się kilka miesięcy temu z telefonów Premium z Androidem. Nie muszę ładować kilka razy dziennie. System jest bardzo lekki imię muli telefonu. Za niewiele ponad 600 pln można mieć telefon, który u konkurencji z Androidem kosztuje  1500-2000 pln. Mam tu na myśli sprawność urządzenia.",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "0",
        "posted": "2015-10-09 20:19:56",
        "purchased": null
    },
    {
        "id": "3216455",
        "author": "Ewa",
        "recommendation": null,
        "stars": "5/5",
        "content": "Lumia spełnia moje oczekiwania odnośnie smartfonu w średnim przedziale cenowym.Robi dobre zdjęcia, nie zawiesza się, trochę słaba widocznosć w pełnym słońcu, ogólnie oceniam Lumię 640 pozytywnie.",
        "pros": [],
        "cons": [],
        "upvote": "8",
        "downvote": "6",
        "posted": "2015-07-01 01:12:50",
        "purchased": "2015-05-15 12:11:11"
    },
    {
        "id": "4631552",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "3,5/5",
        "content": "telefon użytkuje od ponad roku, największy plus to jakość rozmów, wykonuje ich bardzo dużo każdego dnia, nic się nie zacina, nic się nie rozłącza. szybkość działania ok, jeśli ktoś lubi windowsa będzie zadowolony. Generalnie po roku użytkowania bardzo zacina się opcja wysyłania smsów masowo (do wielu numerów)",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-05-04 15:49:57",
        "purchased": null
    },
    {
        "id": "3181982",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "2,5/5",
        "content": "Telefon jest bardzo przeciętny. Miał być do bólu prosty i niezawodny. Ale opowieści o szybkim Windows Phonie bijącym na głowę Androida można między bajki włożyć. 2-letni Android ze średniej półki rozkłada ten telefon jak chce. Jakie było moje zdziwienie, gdy okazało się, że telefon zwyczajnie przycina się przy nagrywaniu video - obraz dziwnie się deformował, a momentami wręcz pływał. Wszystko ograniczone do granic możliwości rodem z iOS, co sprawia że urządzenie nie jest proste, a prostackie. Telefon poleciłbym jedynie nie wymagającym użytkownikom, którzy nie nagrywają video, nie instalują aplikacji i nie odczuwają potrzeby dopasowania systemu do własnych potrzeb.",
        "pros": [],
        "cons": [
            "funkcjonalność"
        ],
        "upvote": "7",
        "downvote": "30",
        "posted": "2015-06-08 14:46:54",
        "purchased": null
    },
    {
        "id": "3505950",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "1/5",
        "content": "Straszny chłam. Moja mama nie potrafi tego obsługiwać a i ja mając już ponad 15 telefonów na androidzie uważam, że to gniot jakich wiele. Odebrać telefonu się nie da na raz bo trzeba ciągle coś odsuwać przesuwać a ekran nie reaguje, nie da się wyłączyć podświetlenia klawiszy z klawiatury ani wyłaczyć podpowiadacza wyrazów, uruchomienie tez trzeba się klikać lub z boku wcisnąć żeby telefon przeszedł do głownego menu. Ten sprzęt to koszmar. Te wszystkie pozytywne komentarze to chyba od ludzi co przeszli z manty nie obrażając manty.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "9",
        "posted": "2015-12-31 11:14:33",
        "purchased": null
    },
    {
        "id": "3212355",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "1/5",
        "content": "Totalny badziew. Używałem 3 tygodnie. Kolory brzydkie, mało nasycone, wyświetlacz tragiczny czerń nie jest czarna a biały jest siwy, Obudowa tandetna, Trzeszczący plastik, tylna klapa na zatrzaski, które lodwo co trzymaja a po paru zdjęciach klapki schodzi jenym palcem. Klawiatura tragiczna, nie można wyłaczyć podświtlenia liter co bardzo denerwuje. Aparat strszana lipa. Zero ostrości, kolory nienaturalne, pastelowe. Wewnątrz mydło. Dodawanie własnych dzwonków przez aplikacje ze sklepu. Pozytywy rzecz to bateria trzyma dobrze, system dośc szybki, mogłby byc glośniejszy. Nastepna sprawa to odbieranie połaczeń. Jesli chcesz szybko odebrać połaczenie musisz najpierw przesuwać odblokuj dopiero odbierz. To ma byc szybki telefon? W słońcu zero widocznosci. Szczerze mówiac (a uzywam S5) to dla mnie ta lumia to totalny badziew i nie wart tych pienieniedzy.",
        "pros": [],
        "cons": [
            "kiepski system",
            "mało aplikacji",
            "kiepskie kolory",
            "nedzne zdjecia",
            "nędzny ekran",
            "slaba obudowa"
        ],
        "upvote": "2",
        "downvote": "32",
        "posted": "2015-06-27 20:34:00",
        "purchased": null
    },
    {
        "id": "3686680",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Super telefonik za rozsądną kasę. W zasadzie same plusy a jedynie wybór aplikacji trochę mniejszy niż w Androidzie. Przesiadłem się z Samsunga S4 i mimo 3-krotnej różnicy w cenie Lumia niewiele ustępuje Samsungowi. Największe plusy to: czas pracy baterii, stabilny system i jakość zdjęć. Zdecydowanie polecam.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-04-10 19:38:36",
        "purchased": null
    },
    {
        "id": "3305184",
        "author": "Ya...",
        "recommendation": null,
        "stars": "5/5",
        "content": "świetny telefon w cenie. Wszystko tam i szybko. Żywotność baterii jest długa. Tylko obudowa mogła być lepsza. System Windows 10 będzie również aktualizować.",
        "pros": [
            "1280x720",
            "840 godzin",
            "system windows 8.1"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-09-03 09:23:18",
        "purchased": "2015-08-30 21:35:45"
    },
    {
        "id": "3353987",
        "author": "Kecaj1",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Rozsądna cena, możliwości wystarczające aż nadto w codziennym użytkowaniu. Mocna, wymienna bateria, wystarcza nawet na 3 dni. Zdjęcia całkiem,całkiem. Rewelacyjny firmowy futerał w kolorze.",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "0",
        "posted": "2015-10-06 10:21:38",
        "purchased": "2015-09-07 18:35:11"
    },
    {
        "id": "3922729",
        "author": "Daniel",
        "recommendation": null,
        "stars": "5/5",
        "content": "Druga 640-ka LTE w rodzinie. Jeżeli nie jesteś fanem androida, a tolerujesz ograniczenia dot. ilości programów na windows'a, ciekawa alternatywa.",
        "pros": [
            "funkcjonalność",
            "szybki system"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-09-05 10:22:35",
        "purchased": "2016-08-31 08:08:43"
    },
    {
        "id": "3318969",
        "author": "Ewa",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Telefonik bardzo fajny, choć jeszcze nie rozgryzłam wszystkich jego funkcji. Działa bez zastrzeżeń, nie zacina się. Jestem zadowolona z zakupu:)",
        "pros": [],
        "cons": [],
        "upvote": "6",
        "downvote": "1",
        "posted": "2015-09-12 20:02:05",
        "purchased": "2015-08-25 12:04:21"
    },
    {
        "id": "3992712",
        "author": "m@rgo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Przy pełnym użytkowaniu (WiFi + częste rozmowy) bateria trzyma około 1 dnia roboczego, ale nie wiem czy jakiś telefon jest w tej kwestii lepszy.",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-09-29 08:00:15",
        "purchased": null
    },
    {
        "id": "3874400",
        "author": "Ola",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Świetny sprzęt dla osób które korzystają ze smartfonu w \"tradycyjny\" sposób: dzwonienie, pisanie sms, przeglądanie internetu, robienie zdjęć",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-08-10 12:06:44",
        "purchased": "2016-08-07 20:41:23"
    },
    {
        "id": "3342254",
        "author": "Tomasz",
        "recommendation": null,
        "stars": "5/5",
        "content": "Bardzo udany telefon. Świetne parametry za niską cenę. System Windows bardzo stabilny. Zdecydowanie polecam.",
        "pros": [
            "dobra konfiguracja sprzętowa"
        ],
        "cons": [
            "plistikowa obudowa"
        ],
        "upvote": "5",
        "downvote": "3",
        "posted": "2015-09-28 15:59:59",
        "purchased": "2015-08-08 00:05:28"
    },
    {
        "id": "3145188",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4/5",
        "content": "Po raz pierwszy pobawiłem się WP gdyż kupiłem sprzęt na prezent a sam używam S5. Telefonik szybki, obsługa banalna, zmiana dzwonków aplikacją ze sklepu, mapy do pobrania ze sklepu dokładne, interfejs prościutki, żadnych zwiech, przesyłanie bt bezproblemowe, głośny choć jakość dźwięku nie powala, zdjęcia przyzwoite, budowa no cóż plastik dla dzieci, ekran wyraźny, kolory ładne. Bateria standard jak na smartfona. Szybki net dzięki lte, można dzwonić, smsować, robić foty czego chcieć więcej? Jeśli chcesz mieć komputer w telefonie to nie nokia za 500zł a właśnie np. S5 na andku. Niestety głośnik z na plecach to jest koszmar. prawie nie słychać dzwonka a dopiero sms. Uważam, że w niskiej cenie to dobry smartfon. Nowy model tegoroczny ma mieć aktualizację do WP10.",
        "pros": [
            "jakość",
            "niezłe zdjęcia"
        ],
        "cons": [
            "ograniczony system"
        ],
        "upvote": "1",
        "downvote": "1",
        "posted": "2015-05-16 20:14:38",
        "purchased": null
    },
    {
        "id": "3365592",
        "author": "An...",
        "recommendation": null,
        "stars": "5/5",
        "content": "Pierwsze wrażenia z zakupionego produktu bardzo pozytywne. Szkoda, że instrukcja dołączona do telefonu jest więcej niż skromna, ale takie są obecnie standardy.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2015-10-13 21:56:47",
        "purchased": "2015-10-07 20:58:05"
    },
    {
        "id": "3356093",
        "author": "MasterSoftPL",
        "recommendation": null,
        "stars": "5/5",
        "content": "Bardzo  fajny  telefon jak  za tą cenę lepszy  od telefonów z androidem . Świetna nawigacja . Mustafo  funkcji .Polecam",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2015-10-07 11:53:32",
        "purchased": "2015-09-08 10:12:12"
    },
    {
        "id": "3483217",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Świetny telefon do pracy. Płynne działanie wszystkich aplikacji. Szkło wyświetlacza odporne na zarysowania.",
        "pros": [],
        "cons": [
            "szybko brudząca się tylna klapka"
        ],
        "upvote": "1",
        "downvote": "1",
        "posted": "2015-12-18 11:36:29",
        "purchased": "2015-12-14 12:52:17"
    },
    {
        "id": "4235800",
        "author": "Marcin",
        "recommendation": null,
        "stars": "5/5",
        "content": "to mój drugi taki sam telefon jestem z  niego bardzo zadowolony jedyny mankament jaki zauważyłem to czasami muszę zrestartować telefon by zadziałał internet",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-11-26 15:43:33",
        "purchased": "2016-11-15 11:50:30"
    },
    {
        "id": "4426763",
        "author": "Anna",
        "recommendation": null,
        "stars": "5/5",
        "content": "Produkt spełnia oczekiwania, telefon sprawny, bateria trzyma tyle ile w takich telefonach powinna trzymać, dobry wyświetlacz, łatwy w obsłudze. Polecam",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-02-13 12:08:06",
        "purchased": "2017-01-08 22:37:36"
    },
    {
        "id": "3236985",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Jestem początkującym użytkownikiem smartfonów, wcześniej byłem ich zagorzałym przeciwnikiem. Jednak teraz wszystko się zmieniło. Z czystym sumieniem mogę go polecić innym użytkownikom. Wszystko co mi potrzeba mam w jednym urządzeniu. Dźwięki są spoko, głos wyraźny, czysty i głośny. Zdjęcia robi naprawdę ładnie, jest intuicyjny, nie trzeba było czytać instrukcji, zresztą taki sam system mam w pc więc z tym nie było problemów. Bateria hmm, nie mam porównania ale wiem, że od takich telefonów nie ma co wymagać aby trzymał baterię tygodniami, i tego naprawdę się obawiałem, jednak u mnie ładowanie jej odbywa się co 3 - 4 dni. Zaraz usłyszę tu krytykę że jakim cudem ano śpieszę wyjaśnić, że jeśli bawiłem się wszystkim co ten telefon tam ma to i w pół dnia mi zabrakło energii. Natomiast jak tylko mam uruchomioną 1 kartę sim a wi-fi bądź przesył danych z karty włączam jedynie w chwili korzystania z netu to spokojnie taki wynik osiągam. Ekran jest duży, przejrzysty. Jedyna wada to to że nie wszędzie się mieści no i aby go sprawnie używać potrzebna druga ręka he he.",
        "pros": [
            "doskonała paleta barw"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-07-15 16:05:31",
        "purchased": null
    },
    {
        "id": "3821932",
        "author": "Damian",
        "recommendation": null,
        "stars": "5/5",
        "content": "bardzo sprawny i dający duże możliwości. Bateriepo pełnym naładowaniu nawet długo trzyma. Wszystko szybko działa. Fajny duży wyświetlacz.",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "0",
        "posted": "2016-07-13 22:18:17",
        "purchased": "2016-05-17 16:25:47"
    },
    {
        "id": "3813930",
        "author": "Piotr",
        "recommendation": null,
        "stars": "5/5",
        "content": "Identyczny model używam od 6 miesięcy. Jednak ekrany dotykowe szybko się wypalają w tym modelu",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-07-08 11:52:45",
        "purchased": "2016-06-30 17:42:33"
    },
    {
        "id": "3758775",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "telefon bardzo dobrze mi się sprawuje dotyk działa super nie zawiesza się zdjęcia robi bardzo ładne i jest taki podręczny do przeglądania internetu jest super i przy okazji rejestruje ruch",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-05-25 12:54:46",
        "purchased": null
    },
    {
        "id": "3350487",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefon posiadam od ponad miesiąca, spełnił wszystkie moje wymagania. Gorąco polecam.",
        "pros": [],
        "cons": [],
        "upvote": "8",
        "downvote": "3",
        "posted": "2015-10-04 12:25:48",
        "purchased": "2015-08-14 12:57:18"
    },
    {
        "id": "3390619",
        "author": "Szczepan",
        "recommendation": null,
        "stars": "5/5",
        "content": "Miesiąc korzystania i jak na razie żadnych problemów. Dwie karty sim bardzo ułatwiają korzystanie z dwóch numerów.",
        "pros": [],
        "cons": [],
        "upvote": "2",
        "downvote": "2",
        "posted": "2015-10-29 15:07:06",
        "purchased": "2015-09-23 19:57:05"
    },
    {
        "id": "3834193",
        "author": "Joanna",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Fajny telefon w rozsądnej cenie, spełnił moje oczekiwania. Polecam każdemu!",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "1",
        "downvote": "0",
        "posted": "2016-07-20 13:53:37",
        "purchased": "2016-07-06 15:49:46"
    },
    {
        "id": "3197892",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Bardzo dobry aparat, windows prosty w obsludze, duzy ekran i do tego lte. Dobre zdjecia i filmy.Polecam zwlaszcza ze cena jest b.przystepna.",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "4",
        "downvote": "0",
        "posted": "2015-06-18 12:11:48",
        "purchased": null
    },
    {
        "id": "3765492",
        "author": "J.K.",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Ogólnie telefon bardzo dobry. Prosty w obsłudze i szybki w działaniu. Jedyny jak na razie minus, to brak aktualizacji do Windows 10.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-05-31 11:07:50",
        "purchased": "2016-05-22 11:38:40"
    },
    {
        "id": "6407674",
        "author": "Art",
        "recommendation": null,
        "stars": "5/5",
        "content": "Super telefon z super systemem, niestety podzielił już los dinozaurów.",
        "pros": [
            "czas pracy na baterii",
            "funkcjonalność",
            "łatwość obsługi",
            "szybki system",
            "wygląd"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-12-28 21:33:18",
        "purchased": "2017-12-20 00:37:04"
    },
    {
        "id": "3341616",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Bardzo fajny aparat. Dwie karty współpracują ze sobą bez kłopotu. Aero2 działa jak trzeba.",
        "pros": [],
        "cons": [],
        "upvote": "4",
        "downvote": "1",
        "posted": "2015-09-28 10:07:23",
        "purchased": "2015-09-14 20:00:24"
    },
    {
        "id": "3843872",
        "author": "Rafał",
        "recommendation": null,
        "stars": "3,5/5",
        "content": "Po trzech miesiącach korzystania z telefonu stwierdzam, że jestem z niego zadowolony. Do jego zalet należą:\r\n- długi czas pracy na baterii\r\n- płynność działania (strony internetowe szybko się ładują, aplikacje działają płynnie)\r\n- aparat\r\n- rozmiar\r\n- wyświetlacz\r\n\nWady systemowe\r\n- Największym mankamentem smartfona jest jego system operacyjny. Przed aktualizacją do win 10 mogłem korzystać z nawigacji Here Drive, która jest teraz niedostępna. Do tej pory nie udało mi się znaleźć godnego następcy\r\n- Wiele cennych aplikacji nie zostało udostępnionych na win 10 (np. pokemony)\r\n- Po aktualizacji system działa wolniej. Gdyby nie przejście do win 10 oceniłbym urządzenia na 5.\r\n\nWady techniczne\r\n- Przy dłuższym korzystaniu urządzenie mocno się nagrzewa (szczególnie jeśli korzystamy z nawigacji, albo prowadzimy dłuższą korespondencję)",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-07-26 10:09:48",
        "purchased": null
    },
    {
        "id": "3301455",
        "author": "Da...",
        "recommendation": null,
        "stars": "5/5",
        "content": "Świetny telefon. Uwielbiam smartfony na windowsie, niestety nie wielu producentów takie posiada.",
        "pros": [],
        "cons": [],
        "upvote": "3",
        "downvote": "2",
        "posted": "2015-08-31 21:33:11",
        "purchased": "2015-08-14 16:33:07"
    },
    {
        "id": "3296388",
        "author": "Tomasz",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Bardzo dobry telefon w niskiej cenie. System operacyjny działa bardzo płynni. Gorąco polecam.",
        "pros": [],
        "cons": [
            "plistikowa obudowa"
        ],
        "upvote": "0",
        "downvote": "4",
        "posted": "2015-08-27 17:37:27",
        "purchased": "2015-08-08 00:05:28"
    },
    {
        "id": "3421011",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "W tym przedziale cenowym a kupiłem tel za 554 zł to możliwie najlepszy wybór. Lte działa dobrze mimo to w Polsce dopiero wchodzi na rynek są problemy z zasięgiem nawet w centrum Wawy szczególnie w budynkach więc jest zbyteczne. Wifi działa bez zarzutu. Bateria trzyma tylko 2 dni przy bardzo średnim użytkowaniu. Procesor jest sredni- szału nie ma, tragedii również. Aplikacji jest sporo w sklepie windows store. Wszystkie aplikacje sa bezpłatne. Ogromnym plusem jest to że ani raz nie złapał żadnej zwiechy a nawet najmniejszej przyciny. Działa bardzo płynnie. Jest znacznie lepszy niż telefony na Androdzie w podobnej grupie cenowej. Otwarzacz muzyki okey choć trochę zbyt ubogi a przecież to tylko tel. Aparat robi niezłe zdjęcia. Polecam",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-11-16 21:59:43",
        "purchased": null
    },
    {
        "id": "3509699",
        "author": "Da...",
        "recommendation": null,
        "stars": "5/5",
        "content": "Duży ekran, płynność aplikacji, jakoś bardziej go lubię od androidów. Niestety to już nie stara dobra nokia",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-01-02 23:25:33",
        "purchased": "2015-12-09 17:26:39"
    },
    {
        "id": "3139106",
        "author": "Lidia",
        "recommendation": null,
        "stars": "5/5",
        "content": "Produkt bardzo fajny. Wygodny w użyciu. Duży ekran fajnie czyta się informacje,  wiadomości z Internetu.",
        "pros": [],
        "cons": [],
        "upvote": "9",
        "downvote": "10",
        "posted": "2015-05-12 23:55:36",
        "purchased": "2015-05-02 21:07:51"
    },
    {
        "id": "3868055",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Działa szybko, bez zwieszania się czy potrzeby restartów, możliwa aktualizacja do win 10.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-08-06 22:00:02",
        "purchased": "2016-07-12 23:35:49"
    },
    {
        "id": "8560922",
        "author": "a...a",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Świetny stosunek jakości do ceny. Za moment miną dwa lata korzystania z tego telefonu i mimo kilku zawieszeń nie mam większych zastrzeżeń.",
        "pros": [
            "funkcjonalność",
            "wygląd"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2018-11-14 00:19:36",
        "purchased": null
    },
    {
        "id": "3691978",
        "author": "Grzegorz",
        "recommendation": null,
        "stars": "5/5",
        "content": "Bardzo dobry stosunek ceny do jakości, telefon świetnie sprawdza się gdy oczekujemy od niego podstawowych funkcjonalności Smartfona",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-04-13 15:05:21",
        "purchased": null
    },
    {
        "id": "3566112",
        "author": "J.S.",
        "recommendation": null,
        "stars": "5/5",
        "content": "Microsoft Lumia 640 DualSIM posiadam już kilka miesięcy i jestem z niej bardzo zadowolony. Telefon jest szybki, nie zacina się, nie wiesza. System jest intuicyjny i bardzo łatwo się do niego przyzwyczaić. Wykonanie bardzo ładne, szybka pomimo aktywnego użytkowania nie posiada żadnych rys. Tak jak już wiele osób wspomniało - jest mniej dostępnych aplikacji niż na Android ale dla przeciętnego użytkownika w zupełności wystarczy. Podsumowując - nie widzę żadnych wad w/w telefonu, a stosunek jakość - cena jest bardzo dobra.",
        "pros": [
            "szybki system"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-02-04 07:51:12",
        "purchased": null
    },
    {
        "id": "3973869",
        "author": "czarownica_15",
        "recommendation": null,
        "stars": "5/5",
        "content": "Bardzo fajny telefon.",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-09-22 17:08:31",
        "purchased": "2016-09-12 14:03:30"
    },
    {
        "id": "5123091",
        "author": "Dawid",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Dziala juz prawie 2,5 roku. Nic sie nie dzieje poza tym ze od czasu do czasu przegladarka sie zawiesza i fb nie odtwarza. Szkoda ze Microsoft sie wycofal, bo udany pomysl.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-10-13 00:24:04",
        "purchased": null
    },
    {
        "id": "3638385",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4/5",
        "content": "Telefon średni. Grafika jest bardzo dobra. Minusy zaczynają się od procesora. Jak na datę produkcji mógł być lepszy. Jeśli myślisz o grach, problemu nie stanowi samo urządzenie ale system operacyjny. Windows Phone 8.1 jest pozbawiony różnych popularnych gier i aplikacji np. Dragon City tutaj nie ma. Po wybrzydzeniu przejdźmy do plusów. Bez awaryjność. Klawiatura, najlepsza jaką widziałam sugerowanie słów , pisanie wężykiem super. Dual sim jest epickie. Wyświetlacz w stosunku jakość cena ✔. Jeśli nie macie kasy na iPhone to polecam. W bierzecie 1000 PLN nie polecam",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-03-12 21:30:44",
        "purchased": null
    },
    {
        "id": "3418849",
        "author": "Mateusz",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefon sprawuje się bardzo dobrze. Jest szybki, nie zawiesza się, można uruchamiać wymagające gry i aplikacje i nadal będzie szybko śmigał. Wyświetlacz bardzo dobrze oddaje kolory i jest całkiem jasny. Obudowa jest bardzo wytrzymała, odporna na zarysowania. Bardzo dużą zaletą jest szybki aparat, który momentalnie ustawia ostrość i robi zdjęcie.\r\nTelefon jest spory, toteż osobom z małymi dłońmi może sprawiać trudność obsługiwanie go jedną ręką.\r\nPod względem stosunku jakości do ceny, telefon według mnie wypada wyśmienicie, także niezdecydowanym gorąco go polecam",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-11-15 14:05:33",
        "purchased": null
    },
    {
        "id": "3755663",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "1/5",
        "content": "Podczas czytania w internecie czasem zacina się przesuwanie strony w dół. Czytając w pozycji leżącej na plecach ekran waruje. Zawsze odwraca stronę internetową, tak, że musisz obracać telefonem. Z reguły kiedy odwrócisz, to telefon znowu odwróci obraz, tak, że czasem masz go do \"góry nogami\". Innymi słowy, ma coś nie tak z wykrywaniem twarzy.\r\nLiterki na niektórych stronach niewyraźne, z czym nie spotkałem się na innym, tańszym telefonie z Androidem. \r\nSterownie, wyszukiwanie głosem w internecie nie działa. Trzeba ściągnąć aplikację Google - na szczęście tę jedną Google udostępniła dla Microsoftu. \r\nI wiele innych niedogodności i mankamentów o których nie chce mi się nawet pisać.\r\nNp. nie da się lądować wyłączonego telefonu. Nie wiem, czy budzik działa przy wyłączonym telefonie - jeszcze nie sprawdzałem.\r\nDrugi raz nie kupiłbym, Nie polecam.",
        "pros": [],
        "cons": [
            "funkcjonalność"
        ],
        "upvote": "2",
        "downvote": "0",
        "posted": "2016-05-22 19:21:56",
        "purchased": null
    },
    {
        "id": "10695721",
        "author": "Agnieszka",
        "recommendation": null,
        "stars": "5/5",
        "content": "telefonik mam juz przeszło 3 lata jestem z niego zadowolona,sprawny,przeżył kilka upadków,niezawodny i płynnie działa",
        "pros": [
            "funkcjonalność",
            "wygląd"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2019-06-24 13:59:21",
        "purchased": null
    },
    {
        "id": "3219076",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Używam telefon już 2 tydzień , do tego czasu zero wad a same plusy.POLECAM!",
        "pros": [
            "funkcjonalność",
            "stabilność",
            "szybki system"
        ],
        "cons": [
            "brak diody informującej o zdarzeniach"
        ],
        "upvote": "6",
        "downvote": "2",
        "posted": "2015-07-02 17:49:54",
        "purchased": null
    },
    {
        "id": "10562658",
        "author": "Zbignew",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Wybrałem ten telefon z uwagi na przywiązanie do systemu windows.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2019-05-23 11:04:38",
        "purchased": "2019-05-19 14:14:27"
    },
    {
        "id": "3289869",
        "author": "Dana.",
        "recommendation": null,
        "stars": "5/5",
        "content": "Produkt w 100% spełnił moje oczekiwania. Polecam.",
        "pros": [],
        "cons": [],
        "upvote": "9",
        "downvote": "8",
        "posted": "2015-08-23 20:49:06",
        "purchased": "2015-08-02 15:22:09"
    },
    {
        "id": "3724345",
        "author": "fgret",
        "recommendation": null,
        "stars": "5/5",
        "content": "telefon super",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-05-02 07:48:48",
        "purchased": "2016-04-09 12:18:27"
    },
    {
        "id": "3273145",
        "author": "Greg",
        "recommendation": null,
        "stars": "4/5",
        "content": "zakup zgodny z zalozeniami, ciekawy i dobrej jakosci telefon.",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "2",
        "posted": "2015-08-11 12:20:04",
        "purchased": "2015-08-06 20:31:04"
    },
    {
        "id": "10073050",
        "author": "Henryk",
        "recommendation": null,
        "stars": "1/5",
        "content": "Telefon nagrzewa się i samoczynnie się zawiesza lub resetuje. Co raz mniej aplikacji. Przy korzystaniu z nawigacji uchwyt zasłania głośnik umiszczony z tyłu. Po 5 latach korzystania z tego telefonu nikpmu nie polecam.",
        "pros": [
            "bardzo dobra czerń",
            "bardzo dobry aparat ze świtetnym trybem",
            "błyskawiczne działanie aplikacji i gier",
            "doskonała paleta barw",
            "łatwość obsługi",
            "mapa bez  połączenia z intrenetem",
            "możliwość rozbudowy pamięci",
            "nedzne zdjecia",
            "nędzny ekran",
            "nie można ustawić przypomnienia dowolnie",
            "niezłe zdjęcia",
            "problem z odbiorem zdjęć przez bluetooth",
            "sygnał przypomnienia trwa zbyt krótko",
            "system operacyjny zajmuje b. duzo miejsc",
            "wygląd",
            "wyświetlacz ips",
            "wyświetlacz odporny na zadrapania",
            "zdejmowana tylna klapka",
            "zdjęcia dobrej jakości",
            "zdjęcia w porzadku jak za to cenę"
        ],
        "cons": [
            "aktualizacja do windows 10",
            "aparat 8mpx",
            "bardzo dobra jakość i głośność rozmów",
            "brak diody informującej o zdarzeniach",
            "brak stabilizacji w aparacie",
            "czas pracy na baterii",
            "czasem gubi zasieg",
            "do aparatu potrzebne dodatkowe aplikacje",
            "dobra konfiguracja sprzętowa",
            "drogie firmowe akcesoria",
            "duże ramki ekranu",
            "duży i wygodny wyświetlacz",
            "fatalna intuicyjność menu",
            "funkcjonalność",
            "genialna cena",
            "instrukcja online",
            "intuicyjny",
            "dopracowany soft",
            "kiepski system",
            "mało aplikacji",
            "na razie nei",
            "plistikowa obudowa",
            "płynny i stabilny system",
            "połączenia danych przez siec komórkową",
            "responsywność",
            "slaba obudowa",
            "stabilność",
            "system nie zamula",
            "szybki system",
            "szybko brudząca się tylna klapka",
            "świetna nawigacja",
            "tylko 8 gb pamięci wewnętrznej",
            "tylko kupować i używać",
            "tylko używać",
            "windows phone - system na lata",
            "wm8.1",
            "wsparcie producenta",
            "wystarczające parametry",
            "zbyt delikatny",
            "zintegrowane usługi microsoftu"
        ],
        "upvote": "0",
        "downvote": "0",
        "posted": "2019-02-09 17:41:50",
        "purchased": null
    },
    {
        "id": "4131015",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "1,5/5",
        "content": "Potrzebowałem nowego telefonu i brat polecił Lumie wiec wybrałem ten telefon. Niestety zawiodłem się po 3 miesiącach użytkowania. Telefon czasami posiada \"ściny\" i spadki klatek w grach które są naprawdę mało wymagalne. Jednak bede musiał znowu przejść na Androida.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-10-31 09:45:01",
        "purchased": null
    },
    {
        "id": "5139285",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "1/5",
        "content": "Telefon posiadam od roku. Służy mi jako służbowy. Sam go wybieram i niestety bardzo tego żałuję. Podstawowy zarzut i mankament to słabe parametry uniemożliwiające normalną pracę - po otwarciu 4-5 stron internetowych w tle telefon wiesza się i trzeba od nowa uruchamiac przeglądarkę. Czegoś takiego nie mogę zniesc, dla mnie jest to wada dyskwalifikująca dany model. Co jeszcze .. bateria bardzo przeciętna, średnie użytkowanie (kilkanaście rozmów w ciągu dnia, przeglądanie netu, poczta) - wieczorem już ledwie zipie. Sklep z aplikacjami - cóż można powiedziec o projekcie który Microsoft wygasza..\r\nMoja rada - jeżeli potrzebujesz smartphona do normalnego użytkowania (nie mam na myśli gier i innych wymagających czynności) ten model, według mnie, jest bardzo słaby.",
        "pros": [],
        "cons": [
            "czas pracy na baterii",
            "funkcjonalność",
            "wygląd"
        ],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-10-19 08:53:15",
        "purchased": null
    },
    {
        "id": "4149593",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "2/5",
        "content": "Fatalna jakość rozmów. Gdy korzystam z tego telefonu muszę prawie krzyczeć, żeby rozmówca mnie słyszał. Telefon oddany na gwarancję, wrócił z podobno wymienionym mikrofonem, ale problem nie został rozwiązany. Wyczytałem gdzieś, że może być to problem z oprogramowaniem i po zresetowaniu telefonu powinien się rozwiązać. Faktycznie było trochę lepiej (ale ciągle dużo gorsza słyszalność niż w JAKIMKOLWIEK telefonie jaki miałem do tej pory), ale tylko przez parę dni. Telefon kupiony na prezent dla mamy, która teraz odbiera go tylko po to, żeby powiedzieć, że oddzwoni ze stacjonarnego jak wróci do domu. Rozumiem, że każdemu zdarzają się wady fabryczne, ale jeśli raz oddaję telefon na gwarancję, a on wraca z serwisu i dalej są z nim problemy, to niestety producent jest u mnie spalony. Nie polecam!",
        "pros": [],
        "cons": [
            "fatalna jakość rozmów (mikrofon)"
        ],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-11-04 11:28:08",
        "purchased": null
    },
    {
        "id": "3661511",
        "author": "Asia",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Ok.",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-03-27 09:16:14",
        "purchased": "2016-03-08 19:36:09"
    },
    {
        "id": "3176590",
        "author": "Wojtek",
        "recommendation": null,
        "stars": "5/5",
        "content": "Dobry telefonik, spełnia moje oczekiwania",
        "pros": [],
        "cons": [],
        "upvote": "4",
        "downvote": "4",
        "posted": "2015-06-03 23:26:51",
        "purchased": "2015-05-05 15:40:47"
    },
    {
        "id": "4042983",
        "author": "Krzysztof",
        "recommendation": null,
        "stars": "4/5",
        "content": "Ogólnie telefon w porzadku, słaba bateria",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-10-13 07:57:51",
        "purchased": "2016-09-19 21:12:59"
    },
    {
        "id": "3804319",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Super telefon! Bardzo funkcjonalny i estetyczny w bardzo przystępnej cenie. Gorąco polecam.",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-07-01 17:14:28",
        "purchased": null
    },
    {
        "id": "3484959",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Dostałem służbowy Microsoft Lumia 640. Bateria wystarcza na spokojne 2 dni rozmowy przez telefon. Telefonu głównie używa się do Call Center.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-12-19 10:34:57",
        "purchased": null
    },
    {
        "id": "3760294",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4/5",
        "content": "Telefon Microsoft lumia 640 jest dobrym telefonem .Ma bardzo dobry interface itp.Jedyną wadą jest że niewygodnie trzyma się go w dłoni.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-05-26 21:21:30",
        "purchased": null
    },
    {
        "id": "3471591",
        "author": "ASIA",
        "recommendation": null,
        "stars": "5/5",
        "content": "Prosta w obsłudze i jak na razie niezawodna",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2015-12-13 11:35:25",
        "purchased": "2015-11-19 23:03:00"
    },
    {
        "id": "3882317",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Świetny telefon. Bardzo dobra jakość dźwięku w słuchawce, aparat robi piękne zdjęcia. Wszystko śmiga, nic się nie zawiesza. Polecam!",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-08-15 09:21:03",
        "purchased": null
    },
    {
        "id": "3889103",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "0,5/5",
        "content": "Witam. Rok temu kupiłem sobie Lumie 640 dual sim. Jest to mój pierwszy \"nowy\" telefon, do tej pory jechałem na starym samsungu z klapką. Zaraz po kupnie, byłem zafascynowany nowym telefonem, wszedłem w 21. wiek... A teraz do rzeczy, po roku użytkowania mogę śmiało powiedzieć, że ten telefon to ***** g***a. Gdybym miał teraz kupować telefon nigdy nie wybrałbym Windows Phona. Telefon się wiesza, wywala kontakty z niewiadomych przyczyn, gdy próbuje go wyłączyć on się resetuje, nie ma żadnych aplikacji a te które są nie są aktualizowane. Po prostu porażka, jeżeli chcecie jakieś instagramy, snapchaty albo inne pokemony nie bierzcie Windows Phona. Liczyłem się z brakiem aplikacji na windows phona, ale myślałem, że te mainstreamowe jednak będą dostępne. Cóż przeliczyłem się. Za każdym razem gdy patrze na ten telefon mam ochote rzucić nim w ściane, codziennie mnie denerwuje. Szkoda, że nikt nie chce go kupić i jestem skazany na wspaniałą lumię 640 dual sim.\r\nPS. Jedyne co w tym telefonie działa jak należy to dual sim.",
        "pros": [],
        "cons": [
            "sam się resetuje"
        ],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-08-18 16:58:53",
        "purchased": null
    },
    {
        "id": "4247738",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "0,5/5",
        "content": "Telefon laguje to po 1 po 2 odinstalowałem Skype i go zaistalowac nie moge nie polecam ogólnie Microsoft. Zacina i nie tylko ja tak sądzę do gier najgorszy wybór do pracy jeszcze gorszy ! Telefon nawet nie spelnia podstaqoqyl funkcji.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-11-30 21:32:13",
        "purchased": null
    },
    {
        "id": "3222271",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Super telefon, który posiada masę funkcjonalności. Naprawdę warto kupić za taką cenę.",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "1",
        "downvote": "2",
        "posted": "2015-07-04 10:31:46",
        "purchased": null
    },
    {
        "id": "4243881",
        "author": "Robert",
        "recommendation": null,
        "stars": "5/5",
        "content": "bardzo dobry polecam",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-11-29 15:01:53",
        "purchased": "2016-11-16 11:58:11"
    },
    {
        "id": "4152320",
        "author": "Marcin",
        "recommendation": null,
        "stars": "5/5",
        "content": "Value, value, value!",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-11-05 08:47:47",
        "purchased": "2016-10-24 15:01:57"
    },
    {
        "id": "4506925",
        "author": "Jan",
        "recommendation": null,
        "stars": "5/5",
        "content": "Jestem zadowolony.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-03-20 20:43:30",
        "purchased": "2017-03-04 16:12:53"
    },
    {
        "id": "4459954",
        "author": "Marita P.",
        "recommendation": null,
        "stars": "5/5",
        "content": "telefon znakomity",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-02-27 17:00:17",
        "purchased": "2017-02-16 15:12:15"
    },
    {
        "id": "4269245",
        "author": "Ewa",
        "recommendation": null,
        "stars": "5/5",
        "content": "Jestem zadowolona",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-12-08 17:54:09",
        "purchased": "2016-12-01 18:35:16"
    },
    {
        "id": "4338045",
        "author": "Kuba",
        "recommendation": null,
        "stars": "5/5",
        "content": "Polecam telefon.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-01-09 09:58:14",
        "purchased": "2016-12-01 10:19:31"
    },
    {
        "id": "3476133",
        "author": "Paweł",
        "recommendation": null,
        "stars": "5/5",
        "content": "fajny telefon",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "1",
        "posted": "2015-12-15 14:21:08",
        "purchased": "2015-10-20 13:11:24"
    },
    {
        "id": "3579802",
        "author": "PawelDudzic",
        "recommendation": null,
        "stars": "5/5",
        "content": "telefon godny polecenia",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-02-11 21:50:33",
        "purchased": "2016-02-09 12:45:25"
    },
    {
        "id": "3638284",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "1,5/5",
        "content": "Ładny telefon z dobrymi parametami jednak po kilku miesiacach juz sie przycina, slabe aplikacje na windows ciezko z tego skozystac, slabe aplikacje na windows, nie polecam.",
        "pros": [],
        "cons": [
            "funkcjonalność",
            "szybki system"
        ],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-03-12 20:11:23",
        "purchased": null
    },
    {
        "id": "3275225",
        "author": "TTruth",
        "recommendation": null,
        "stars": "5/5",
        "content": "Świetny telefon w rozsądnych pieniądzach. Polecam.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "4",
        "posted": "2015-08-12 22:50:04",
        "purchased": "2015-08-07 19:21:30"
    },
    {
        "id": "3523200",
        "author": "Piotr",
        "recommendation": null,
        "stars": "5/5",
        "content": "Najwyższej jakości produkt,naprawdę świetna jakość obrazu i dźwięku.Warty polecenia.",
        "pros": [],
        "cons": [],
        "upvote": "2",
        "downvote": "0",
        "posted": "2016-01-09 17:30:56",
        "purchased": null
    },
    {
        "id": "3409580",
        "author": "jan",
        "recommendation": null,
        "stars": "5/5",
        "content": "Bardzo dobry telefon spełnia moje oczekiwania polecam",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "5",
        "posted": "2015-11-09 14:43:53",
        "purchased": "2015-10-20 08:43:17"
    },
    {
        "id": "3707217",
        "author": "PawelDudzic",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "dobry telefon",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-04-21 21:48:44",
        "purchased": "2016-03-16 16:35:38"
    },
    {
        "id": "3567628",
        "author": "PawelDudzic",
        "recommendation": null,
        "stars": "4/5",
        "content": "super telefon",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-02-04 20:09:31",
        "purchased": "2016-01-27 16:55:50"
    },
    {
        "id": "4387822",
        "author": "Piotr M.",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Ok.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-01-30 12:00:34",
        "purchased": "2017-01-09 14:40:03"
    },
    {
        "id": "3460345",
        "author": "Piotr",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Znakomity produkt w przystępnej cenie,gorąco polecam wszystkim szukającym dobrego produktu",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "0",
        "posted": "2015-12-07 23:13:35",
        "purchased": null
    },
    {
        "id": "3296672",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "1,5/5",
        "content": "W mojej ocenie telefon przereklamowany. Skusiłem się z uwagi na dobrą relację ceny do parametrów ale decyzji zakupowej żałuję.\r\n\nRaz - trwałość. Telefon bardzo delikatny. Ryska na ekranie pojawiła się bardzo szybko i w zasadzie nie wiedzieć skąd. Telefon cały czas w futerale, nie noszony luzem... (?). W moich poprzednich dwóch (HTC wildfire, i Galaxy Core Duos) ekrany nie miały ani jednej rysy po 2 do 3 lat użytkowania. Wytrzymałość na upadki żadna (nawet zakładając, że smartfon to nie stara pancerna nokia). Lumia 640 koleżanki z pracy spadła z biurka na wykładzinę PCV. Skutek ? Pęknięta i wygięta wewnętrzna obudowa (ten cienki pasek biegnący między szkłem wyświetlacza a plastikiem obudowy). Wyświetlacz ocalał co prawda - ale co to ma być? Mój galaxy core latał nie raz i nie dwa i nic mu nie było.\r\n\nDwa - windows phone. wszem system jest szybki. Ale szybki jest chyba tylko dlatego , że został wykastrowany ze wszelkich możliwych ustawień i opcji. Wystarczy zobaczyć sobie jak wygląda rejestr połączeń. Co to ma być w ogóle, że użytkownicy tego telefonu jak chcą mieć w miarę normalny rejestr połączeń to kombinują z zewnętrznymi apkami. Byłem bardzo pozytywnie nastawiony do WP ale jak na razie totalne rozczarowanie... Może update do 10 uratuje sprawę.\r\n\nTrzy - aparat. Niby parametry super ale fotki wychodzą do ...bani. Dużo gorsze niż z 5 mega pixeli samsunga core. Owszem Lumia ma sporo fajnych ustawień ale zrobić tym telefonem dobre zdjęcie przy świetle słabszym niż pełne słońce graniczy z cudem.\r\n\nz plusów - żeby oddać sprawiedliwość producentowi - bardzo dobry dźwięk, niezła bateria, fajny design...\r\n\nOgólnie jednak nie polecam. Co do windows phone'a - wiem, że ma wielu zwolenników więc nie musi być to wadą. Trwałość urządzenia jest jednak poważną wadą bo ten telefon to taka trochę jednorazówka...",
        "pros": [],
        "cons": [],
        "upvote": "7",
        "downvote": "7",
        "posted": "2015-08-27 22:25:22",
        "purchased": null
    },
    {
        "id": "3455859",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "1,5/5",
        "content": "1. Mniejsza intuicyjność niż Android. Jest to opinia zarówno moja (2 lata na Androidzie) jak Żony, która nie miała wcześniej smartfona. W tej kwestii w zasadzie jest tragedia\r\n2. Problemy z łączeniem się z WiFi - gorzej chwyta niż GT-i-8262. \r\n3. Często trzeba zrestartować telefon bo zwykłe wlączenie transferu danych przez siec GSM nie działa. Nawet moją z natury spokojną Żonę szlak trafia.\r\n4. Dobry aparat fotograficzny\r\n5. Zaleta to płynność menu (lepsza niż w GT-i-8262) i długa praca telefonu. Przy naładowaniu 80% starcza na 4 dni przy używaniu glównie jako telefon, przy pełnym używaniu 2 dni. Rzecz nieosiągalna dla Androidów",
        "pros": [
            "długa praca na baterii",
            "płynność"
        ],
        "cons": [
            "fatalna intuicyjność menu",
            "połączenia danych przez siec komórkową"
        ],
        "upvote": "1",
        "downvote": "5",
        "posted": "2015-12-05 14:04:23",
        "purchased": null
    },
    {
        "id": "10674149",
        "author": "Henryk",
        "recommendation": null,
        "stars": "1/5",
        "content": "Podczas korzystania z internetu telefon nagrzewa się i co chwilę resetuje się. Wizyta w serwisie nic nie pomogła. Wyłączono wiele aplikacji. Posiadam ten telefon od 4 lat. Nikomu nie polecam tego telefonu.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2019-06-18 13:23:47",
        "purchased": null
    },
    {
        "id": "3319367",
        "author": "Krzysztof",
        "recommendation": null,
        "stars": "4/5",
        "content": "Bardzo dobry telefon i akcesoria do telefonu firmy Microsoft \npolecam ten telefon dobry do pracy i nie tylko",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2015-09-13 08:41:20",
        "purchased": null
    },
    {
        "id": "3309900",
        "author": "AMIGOz",
        "recommendation": null,
        "stars": "5/5",
        "content": "Bardzo dobry smartfon w przyzwoicie cenia",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "6",
        "posted": "2015-09-07 09:57:53",
        "purchased": "2015-08-18 15:53:24"
    },
    {
        "id": "3538923",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefon naprawdę świetny. Posiadam go od lipca 2015r. Ma naprawdę dobry głośnik i aparat.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-01-18 20:43:08",
        "purchased": null
    },
    {
        "id": "3599284",
        "author": "An...",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefon wykonany ze starannością.Świetny, oryginalny, fantastyczny prezent dla każdego.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-02-23 11:49:06",
        "purchased": null
    },
    {
        "id": "3406501",
        "author": "Piotr",
        "recommendation": null,
        "stars": "5/5",
        "content": "Dobra cena za dobry telefon,niezły sprzęt o niezłych parametrach.fajny ekran i bateria",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2015-11-06 21:20:48",
        "purchased": null
    },
    {
        "id": "3403972",
        "author": "Bartuś",
        "recommendation": null,
        "stars": "5/5",
        "content": "Bardzo fajny telefon polecam mam go 2 mies i się jeszcze nie zacia ani razu",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2015-11-05 17:19:30",
        "purchased": null
    },
    {
        "id": "3222880",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "wszystko supcio",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "1",
        "downvote": "2",
        "posted": "2015-07-04 19:26:54",
        "purchased": null
    },
    {
        "id": "4233898",
        "author": "SwatGustaw",
        "recommendation": null,
        "stars": "3,5/5",
        "content": "Jak na telefon w swoim przedziale cenowy to może być",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-11-25 17:14:57",
        "purchased": null
    },
    {
        "id": "3854033",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "0,5/5",
        "content": "Absolutnie nic nie działa prawidłowo co z tym idzie stabilnie.\r\nCiągle gubi zasięg, aplikacje się cały czas wyłączają.",
        "pros": [],
        "cons": [
            "funkcjonalność"
        ],
        "upvote": "1",
        "downvote": "0",
        "posted": "2016-07-31 15:45:09",
        "purchased": null
    },
    {
        "id": "3366422",
        "author": "Marcin",
        "recommendation": null,
        "stars": "0,5/5",
        "content": "Byłem akurat na wakacjach za granicą rozwaliłem sobie ekran starego telefonu. Potrzebowałem na szybko czegoś nowego, a znajomy polecił akurat tę Lumię. Telefonem nie nacieszyłem się długo, bo po 20 godzinach od zakupu ekran po prostu przestał działać. Coś się rozłączyło, był dźwięk nie było wizji. Miałem już kilkanaście teflonów i nigdy coś takiego się nie stało. telefon na szczęście udało się oddać, ale nie ukrywam, że miało to duży wpływ na moją ocenę.\r\nJeśli zacząłem od wad to wymienię kolejne które zdążyłem zauważyć. Po pierwsze klapka jest zrobiona z bardzo tandetnego, cienkiego plastiku i po kilku otwarciach (zgodnych z instrukcją nic na siłę nie otwierałem) już trzeszczała.\r\nSam system to co prawda to nie wada, a mógłbym go nawet polubić, natomiast wadą jest bardzo ubogi dostęp do aplikacji szczególnie tych darmowych. Weźmy na przykład nawigację. jest co prawda darmowy One Drive, ale nie ma w nim chociażby takiej podstawowej funkcji jak wybieranie punktów pośrednich. By to mieć musiałbym pobrać aplikację i zapłacić za mapy do niej (około 200zł), a na Androidzie wszytko mam w \"pakiecie\".  Dopóki Microsoft nie zadba o lepsze wyposażenie sklepu aplikacowscy tacy jak ja nie mają czego szukać w tym systemie. Jak na szybko policzyłem by mieć dokładnie to samo co na poprzednim telefonie musiałbym wyłożyć około 400zł (w androdzie kosztowało mnie to około 30zł).\r\nTeraz trochę zalet:\r\nszybki system, \r\nniezła rozdzielczość i barwy,\r\nciekawy system kafelkowy,\r\nmożna odinstalować każdą aplikację bez rootu sytemu.\r\n\nPodsumowując telefon i system ma swoje mankamenty, ale da się być może polubić (jeśli nie używasz dużo aplikacji), ale nie było mi to dane. Ocenę wystawiam mojej konkretnej sztuce i nie mogła być wyższa skoro nie wytrzymał nawet doby.",
        "pros": [],
        "cons": [],
        "upvote": "2",
        "downvote": "6",
        "posted": "2015-10-14 11:57:30",
        "purchased": null
    },
    {
        "id": "3248963",
        "author": "reni16",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Telefon znakomity.",
        "pros": [],
        "cons": [],
        "upvote": "2",
        "downvote": "9",
        "posted": "2015-07-23 14:20:50",
        "purchased": "2015-07-20 13:42:03"
    },
    {
        "id": "4506325",
        "author": "zak zak",
        "recommendation": null,
        "stars": "4/5",
        "content": "640 jest ogólnie super, oprogramowanie praktycznie bez zgrzytów. Niestety tylko czasami zawiesza się i samoistnie wychodzi z przeglądarki internetowej. Bateria trzyma długo, nawet, gdy się  bawię. Najgorsza w tym wszystkim jest tylna klapka, która pęka i się kruszy. Lumia ma świetne głośniki wbudowane, dają ostro i czysto. Cena nie zbyt wygórowana, polecam, pod warunkiem, że od razu kupicie obudowę/silikon i szkło hartowane(na wszelki wypadek).",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-03-20 15:58:12",
        "purchased": null
    },
    {
        "id": "3141898",
        "author": "Kasia",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Fajny telefon dla mojej córeczki :)",
        "pros": [
            "wejście na karty"
        ],
        "cons": [],
        "upvote": "10",
        "downvote": "29",
        "posted": "2015-05-14 12:13:38",
        "purchased": "2015-05-11 16:09:21"
    },
    {
        "id": "3293788",
        "author": "Jakub",
        "recommendation": null,
        "stars": "3/5",
        "content": "Po położeniu na płasko dźwięk  jest bardzo  mocno stłumiony mimo ustawienia maksymalnej głośności. Podczas",
        "pros": [],
        "cons": [],
        "upvote": "5",
        "downvote": "3",
        "posted": "2015-08-26 06:53:29",
        "purchased": null
    },
    {
        "id": "3399831",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefon mam ponad 3 miesiące,wybrałam go świadomie po przeczytaniu opinii o nim.Mogę potwierdzić,że ten tel.jest super. Wspaniałe zdjęcia,jest szybki,nie zawiesza się, ,jest głośny sygnał,dobrze słychać rozmówcę i co jest dla mnie najważniejsze łatwość obsługi i chociaż mam 67 lat ogarnełam go dość szybko.",
        "pros": [],
        "cons": [],
        "upvote": "6",
        "downvote": "1",
        "posted": "2015-11-03 19:25:29",
        "purchased": null
    },
    {
        "id": "3555588",
        "author": "Magdalena",
        "recommendation": null,
        "stars": "3,5/5",
        "content": "Ogonie jest ok",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-01-28 14:43:21",
        "purchased": null
    },
    {
        "id": "4102381",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Jest ok 👌",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-10-25 15:07:39",
        "purchased": null
    },
    {
        "id": "3611836",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Dobra lumia",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-03-01 09:50:40",
        "purchased": null
    },
    {
        "id": "4943555",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "W maju minęło 2 lata jak korzystam z tego tel.W zasadzie nic się nie zmieniło,trochę bateria krócej trzyma ale nadal jest głośny,dobrze słychać rozmówcę,robi piękne zdjęcia,dobrze łapie sieć.Wadą jest złe umiejscowienie głośnika ale ja noszę swój w etui i kładę go na brzuszku i bez problemu słychać w drugim pokoju.Polecam go niezbyt wymagającym użytkownikom.",
        "pros": [
            "czas pracy na baterii",
            "funkcjonalność",
            "wygląd"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-08-14 23:09:40",
        "purchased": null
    },
    {
        "id": "3367357",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "1/5",
        "content": "telefon ***** nie działa na kartach sieci play. Potrafi się zawiesić podczas migracji między nadajnikami i do ponownego restartu jest nieaktywny. Serwis radzi przełączenie na 3g więc po co kupować tel tego typu. Dali mi również alternatywę przełączenia się na nadajniki plusa co jest równoznaczne z brakiem możliwości korzystania z szybkiego internetu. Odradzam wszystkim z całego serca ten tel. posiadam tel od lipca i do dnia dzisiejszego byłem jego użytkownikiem przez około miesiąc łącznie resztę czasu spędził w serwisie.",
        "pros": [
            "doskonała paleta barw"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "4",
        "posted": "2015-10-14 21:27:13",
        "purchased": null
    },
    {
        "id": "3197678",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefon bez zbędnych bajerów, dobrze wyposażony o rewelacyjnym stosunku ceny do możliwości, bardzo dobra bateria, działa stabilnie i płynnie, rozmowy czyste bez zakłóceń, aparat dla mnie wystarczający i bardzo dobry, prosty i intuicyjny w obsłudze, używam od 2 miesięcy, sporo ciekawych programików w sklepie",
        "pros": [
            "prostota i intuicyjność obsługi",
            "świetna bateria"
        ],
        "cons": [],
        "upvote": "5",
        "downvote": "0",
        "posted": "2015-06-18 10:28:28",
        "purchased": null
    },
    {
        "id": "3727682",
        "author": "Artur",
        "recommendation": null,
        "stars": "5/5",
        "content": "To mój pierwszy telefon typu smartfon, i jak na razie jestem z niego zadowolony. W sklepie z aplikacjami znalazłem na razie wszystko co chciałem, ale szukałem podstawowych aplikacji. Zaletą jest możliwość pobrania map i korzystania z nawigacji bez połączenia z Internetem. Z szybkości działania i czasu pracy na baterii również jestem zadowolony.",
        "pros": [
            "funkcjonalność",
            "szybki system"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-05-04 17:21:18",
        "purchased": null
    },
    {
        "id": "3214866",
        "author": "Barbara",
        "recommendation": null,
        "stars": "5/5",
        "content": "świetny.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "13",
        "posted": "2015-06-30 07:31:02",
        "purchased": "2015-05-28 09:22:02"
    },
    {
        "id": "3318280",
        "author": "MC",
        "recommendation": null,
        "stars": "5/5",
        "content": "Świetny telefon. Windows phone jest łatwy w obsłudze. W tej wersji ma już wszystkie potrzebne funkcje, w przeciwieństwie do windows phone 7. Dobry aparat. Digitalizer działa bez zarzutu. Ciekawy jest zegar wyświetlany nawet przy wyłączonym ekranie - wyczuwa światło. Na szczęście nie zdążyłem sprawdzić odporności na upadek.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-09-12 11:07:36",
        "purchased": null
    },
    {
        "id": "4320672",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Od kupna tego tel.minęło już ponad półtora roku.Nadal jestem b.zadowolona z zakupu.Bateria trzyma ok.trzech dni jeśli nie korzystam z internetu.Właściwie nic się nie zmieniło od dnia zakupu.Nie wiesza się,robi super zdjęcia, nie gubi zasięgu,jest głośny,dobrze słychać rozmówcę.Myślę,że posłuży mi jeszcze kilka lat .",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-12-30 17:52:01",
        "purchased": null
    },
    {
        "id": "3384740",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "0,5/5",
        "content": "Ta namiastka telefonu to farsa. Mnóstwo błędów. Aktualizacja po lte wisi cały czas na zero. Nie da się tego badziewia zaktualizować. Tandetny niepraktyczny fon.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "10",
        "posted": "2015-10-27 10:10:31",
        "purchased": null
    },
    {
        "id": "4248358",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "1/5",
        "content": "Nie polecam lagi itp. ...",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-12-01 07:20:25",
        "purchased": null
    },
    {
        "id": "3796551",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "0,5/5",
        "content": "Nie polecam, cały czas się wiesza",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2016-06-24 11:01:01",
        "purchased": null
    },
    {
        "id": "3670923",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "0,5/5",
        "content": "Telefon po tygodniu popsuł się i musiałem oddać go na gwarancję. Telefon sprawił mi wiele trudności, założenie konta, konfiguracja, znajdowanie funkcji. Ogólnie smartfony i tablety to nie dla mnie. Urządzenia z androidem są jeszcze gorsze, więc wybrałem mniejsze zło. Bateria trzyma tylko 2,5 dnia. Dobre zdjęcia i filmy. Ogólnie ładny telefon ale strasznie niefunkcjonalny.",
        "pros": [],
        "cons": [
            "funkcjonalność"
        ],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-04-02 00:40:20",
        "purchased": null
    },
    {
        "id": "8624729",
        "author": "jędrzej",
        "recommendation": null,
        "stars": "1/5",
        "content": "Tragedia. \r\n1. Mikrofon słaby, ledwo mnie ludzie słyszą,\r\n2. Raz widzi, raz nie widzi wifi, \r\n3. Raz działa sieć, raz nie, mimo zasięgu,\r\n4. Obsługa lipna - chowa się pasek ze strzałką powrotu i czasem za ***** nie chce się pojawić, trzeba zablokować i odblokować ponownie,\r\n5. Woooooolny,\r\n6. Aplikacje na windows... bez komentarza.\r\n7. Przez aplikację telefon nie da się wyszukać kontaktów.\r\n\nNikomu bym nie polecił.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2018-11-28 10:02:41",
        "purchased": null
    },
    {
        "id": "3186767",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4/5",
        "content": "spoko",
        "pros": [],
        "cons": [
            "na razie nei"
        ],
        "upvote": "1",
        "downvote": "27",
        "posted": "2015-06-11 04:10:06",
        "purchased": "2015-05-24 11:20:10"
    },
    {
        "id": "4928343",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Zdecydowanie polecam, warty swojej ceny, jedyne do czego mozna sie przyczepić to błędy przy instalacji windows phone 10 (ładowanie oraz aplikacje), przez co lepiej zostać przy WinPhone 8. Do tego świetny aparat, wyświetlacz i szybki system.",
        "pros": [
            "bardzo dobra czerń",
            "czas pracy na baterii",
            "dobra konfiguracja sprzętowa",
            "doskonała paleta barw",
            "duży i wygodny wyświetlacz",
            "funkcjonalność",
            "łatwość obsługi",
            "szybki system",
            "wygląd",
            "wyświetlacz odporny na zadrapania",
            "zdejmowana tylna klapka",
            "zdjęcia dobrej jakości"
        ],
        "cons": [
            "stabilność"
        ],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-08-09 13:00:39",
        "purchased": null
    },
    {
        "id": "3567713",
        "author": "nealiablog",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Przede wszystkim kocham windowsa, jest o wiele lepszy niż android. Telefon jest duży a to podstawa. Aparat jest dobry, do tego apki bardzo dobre. Dokupiłam karte sd ale z uwagi na to, że telefon jest tani - to żaden koszt :)",
        "pros": [
            "duży i wygodny wyświetlacz",
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "2",
        "downvote": "1",
        "posted": "2016-02-04 20:47:40",
        "purchased": null
    },
    {
        "id": "3242237",
        "author": "MC",
        "recommendation": null,
        "stars": "5/5",
        "content": "Świetny telefon. Może przydać się dual sim. Nie ma problemów z ekranem dotykowym. (W przeciwieństwie do lumii 535). Według mnie windows phone jest najlepszy i nikt nie powie mi, że android przebija wszystko. ;-)",
        "pros": [
            "możliwość aktualizacji systemu"
        ],
        "cons": [],
        "upvote": "2",
        "downvote": "1",
        "posted": "2015-07-20 11:18:18",
        "purchased": null
    },
    {
        "id": "3476816",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Telefon świetny, bateria przy DUŻYM użytkowaniu trzyma nawet 1,5 dnia! Asphalt 8 chodzi bez ścinek na ustawieniach medium, jest ładny, dobrze lezy w dłoni, za tą cene polecam w 100%",
        "pros": [
            "czas pracy na baterii",
            "nawet dobry aparat z tyłu",
            "wydajna w grach"
        ],
        "cons": [
            "mało dostępnych aplikacji",
            "tylko 8 gb pamięci wewnętrznej"
        ],
        "upvote": "2",
        "downvote": "0",
        "posted": "2015-12-15 19:12:47",
        "purchased": null
    },
    {
        "id": "3738779",
        "author": "Monika",
        "recommendation": null,
        "stars": "5/5",
        "content": "Ja tam jestem zadowolona . Internet LTE coś pięknego duża dobrze wszystko widać na niej nie przycina się tak jak androidy . Bardzo dobra jakość rozmów. Mam od roku",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-05-11 14:32:03",
        "purchased": null
    },
    {
        "id": "4313540",
        "author": "SwatGustaw",
        "recommendation": null,
        "stars": "3/5",
        "content": "Telefon posiadam od roku i moge stwierdzić że po zainstalowaniu aktualizacji do Windows 10 występuje pare błędów. System jak system, w porównaniu do Androida posiada mniej ścin itp. Na obudowie występują ślady palców ale można na to przymknąć oko.",
        "pros": [
            "szybki system"
        ],
        "cons": [
            "funkcjonalność"
        ],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-12-27 22:16:59",
        "purchased": null
    },
    {
        "id": "4679167",
        "author": "TOMASZ",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Telefon mam rok i jest to mój pierwszy telefon z windows. Ogólnie sprawuje się b.d. Jakość w stosunku do ceny rewelacja (kupiłem za 540 PLN). Jedyne co po roku zauważyłem to bateria troszkę krócej trzyma.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-05-19 00:29:43",
        "purchased": null
    },
    {
        "id": "3282489",
        "author": "Tomasz",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Bardzo dobry telefon za niewygórowaną cenę. Działa bardzo płynnie, co jest głównie zasługą dobrej konfiguracji sprzętowej jak i systemu operacyjnego.",
        "pros": [
            "dobra konfiguracja sprzętowa"
        ],
        "cons": [],
        "upvote": "1",
        "downvote": "2",
        "posted": "2015-08-18 11:12:20",
        "purchased": null
    },
    {
        "id": "4014120",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "0,5/5",
        "content": "Telefon działał półtora roku. Nagle przestał. Werdykt autoryzowanego serwisu Microsoftu kontakt z parą wodną. Mogą naprawić za cenę 640zł.Dowód zdjęcie płyty głównej z beznadziejnej jakości bez numerów płyty. Litości. Ten telefon to porostu bubel.\r\nNie piszę tej historii złośliwie , ale by ostrzec takiego samego jak ja nabywcę któremu się nie przelewa ,a firma Microsoft zrobiła mnie w ..... no konia.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-10-06 18:42:32",
        "purchased": null
    },
    {
        "id": "6471954",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4/5",
        "content": "Świetny telefon dla mniej wymagających użytkowników. System łatwy w obsłudze i personalizacji. Ogólnire polecam jak na 300-350 zł.",
        "pros": [
            "czas pracy na baterii",
            "doskonała paleta barw",
            "funkcjonalność",
            "jakość",
            "łatwość obsługi",
            "niezłe zdjęcia",
            "sprawny",
            "świetna nawigacja",
            "wygląd",
            "zdejmowana tylna klapka",
            "zdjęcia w porzadku jak za to cenę"
        ],
        "cons": [
            "ograniczony system",
            "szybki system"
        ],
        "upvote": "0",
        "downvote": "0",
        "posted": "2018-01-14 10:23:36",
        "purchased": null
    },
    {
        "id": "3412846",
        "author": "JANUSZ",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Microsoft Lumia 640 Dual SIM dla mnie jest rewelacyjny. Po pierwsze znakomicie obsługuje dwie karty SIM, po drugie wyraźny głos rozmówcy, po trzecie cena do przyjęcia.",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "0",
        "posted": "2015-11-11 12:23:23",
        "purchased": null
    },
    {
        "id": "3157477",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "ładnie wyglądający smartfon, nawet w gry na nim można pograć już nie mówiąc o cenie! :)",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "4",
        "downvote": "0",
        "posted": "2015-05-23 17:26:26",
        "purchased": null
    },
    {
        "id": "8625870",
        "author": "SK",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefonu używam od kilku lat i do tej pory poza BB uważam, że to najpłynniej dzialajacy telefon. Polecam w 100%.",
        "pros": [
            "czas pracy na baterii",
            "duży i wygodny wyświetlacz",
            "działa sprawnie",
            "nie zawiesza się",
            "funkcjonalność",
            "system nie zamula",
            "szybki system",
            "wygląd",
            "zdjęcia dobrej jakości"
        ],
        "cons": [
            "mało dostępnych aplikacji"
        ],
        "upvote": "0",
        "downvote": "0",
        "posted": "2018-11-28 11:53:43",
        "purchased": null
    },
    {
        "id": "3680316",
        "author": "Anonimowy",
        "recommendation": null,
        "stars": "5/5",
        "content": "Telefonik sprawuje się bardzo dobrze, ma świetny wyświetlacz, i szybki procesor. Dobrze robi zdjęcia,",
        "pros": [
            "bardzo dobra jakość i głośność rozmów",
            "system nie zamula",
            "tylko kupować i używać"
        ],
        "cons": [
            "duże ramki ekranu"
        ],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-04-07 11:21:33",
        "purchased": null
    },
    {
        "id": "4181001",
        "author": "bmb100",
        "recommendation": null,
        "stars": "5/5",
        "content": "Super telefon, można dużo korzystać z internetu nic się nie zawiesza nic nie psuje, bardzo zgrabny, bateria trzyma 2 dni przy dużym uzytkowaniu",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-11-11 19:16:31",
        "purchased": null
    },
    {
        "id": "3089363",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "Super smarfon w super cenie. Windows phone daje rade.",
        "pros": [
            "funkcjonalność"
        ],
        "cons": [],
        "upvote": "4",
        "downvote": "3",
        "posted": "2015-04-12 14:10:50",
        "purchased": null
    },
    {
        "id": "3284375",
        "author": "Ada",
        "recommendation": null,
        "stars": "5/5",
        "content": "Mega pozytyw po przesiadce z andka... Fajny duży ekran , zero zawieszek, szybki i bez problemowy. Aparat dobry, ten na tyle jak i",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "2",
        "posted": "2015-08-19 15:37:01",
        "purchased": null
    },
    {
        "id": "3284373",
        "author": "Ada",
        "recommendation": null,
        "stars": "5/5",
        "content": "Mega pozytyw po przesiadce z andka... Fajny duży ekran , zero zawieszek, szybki i bez problemowy. Aparat dobry, ten na tyle jak i",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "2",
        "posted": "2015-08-19 15:37:01",
        "purchased": null
    },
    {
        "id": "3368481",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "1/5",
        "content": "Koszmarny tani badziew. Niedopracowane oprogramowanie, nienaturalny głoś w słuchawce, nędzny wyświetlacz, rozłącza się, strony ładuje wolno, windows phone tragiczny pod każdym względem. Totalny brak aplikacji w telefonie a jak chcesz cokolwiek musisz ściągać z serwera. Np zmiana dzwonka na swój własny. To jakaś parodia telefonu.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "8",
        "posted": "2015-10-15 13:52:29",
        "purchased": null
    },
    {
        "id": "3546933",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Wszystko jest ok !!!",
        "pros": [
            "1280x720",
            "2 karty",
            "840 godzin",
            "aktualizacja do windows 10",
            "aparat 8mpx",
            "b. dobry głośnik",
            "bardzo dobra czerń",
            "bardzo dobry aparat ze świtetnym trybem",
            "błyskawiczne działanie aplikacji i gier",
            "brak diody informującej o zdarzeniach",
            "brak stabilizacji w aparacie",
            "czas pracy na baterii",
            "czasem gubi zasieg",
            "często nie można się do mnie dodzwonić",
            "długa praca na baterii",
            "do aparatu potrzebne dodatkowe aplikacje",
            "dobra konfiguracja sprzętowa",
            "doskonała paleta barw",
            "drogie firmowe akcesoria",
            "duże ramki ekranu",
            "duży i wygodny wyświetlacz",
            "duży wybór bezpłatnych aplikacji",
            "trzeba",
            "działa sprawnie",
            "nie zawiesza się",
            "fatalna intuicyjność menu",
            "funkcjonalność",
            "funkcjonalność",
            "jeżeli ktoś nie lubi an",
            "genialna cena",
            "instrukcja online",
            "intuicyjny",
            "dopracowany soft",
            "jak do tej pory brak",
            "jakość",
            "jeszcze nie znalazłem",
            "kiepski system",
            "mało aplikacji",
            "kiepskie kolory",
            "lumia z windows os",
            "mało dostępnych aplikacji",
            "mapa bez  połączenia z intrenetem",
            "możliwość aktualizacji systemu",
            "możliwość rozbudowy pamięci",
            "na razie brak",
            "na razie nei",
            "nawet dobry aparat z tyłu",
            "nedzne zdjecia",
            "nędzny ekran",
            "nie można ustawić przypomnienia dowolnie",
            "niebieska obudowa",
            "niezłe zdjęcia",
            "ograniczony system",
            "plistikowa obudowa",
            "płynność",
            "płynny i stabilny system",
            "połączenia danych przez siec komórkową",
            "problem z odbiorem zdjęć przez bluetooth",
            "prosta i logiczna obsłługa",
            "prostota i intuicyjność obsługi",
            "responsywność",
            "slaba obudowa",
            "sprawny",
            "stabilność",
            "sygnał przypomnienia trwa zbyt krótko",
            "system operacyjny zajmuje b. duzo miejsc",
            "system windows 8.1",
            "szybki system",
            "szybko brudząca się tylna klapka",
            "świetna bateria",
            "tylko 8 gb pamięci wewnętrznej",
            "wejście na karty",
            "windows phone - system na lata",
            "wm8.1",
            "wsparcie producenta",
            "wydajna w grach",
            "wyświetlacz ips",
            "wyświetlacz odporny na zadrapania",
            "za duża jak dla mnie",
            "zbyt delikatny",
            "zdejmowana tylna klapka",
            "zdjęcia dobrej jakości",
            "zdjęcia w porzadku jak za to cenę",
            "zintegrowane usługi microsoftu"
        ],
        "cons": [],
        "upvote": "2",
        "downvote": "0",
        "posted": "2016-01-22 19:39:10",
        "purchased": null
    },
    {
        "id": "3648085",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "jestem zadowolony",
        "pros": [
            "bardzo dobra czerń",
            "dobra konfiguracja sprzętowa",
            "doskonała paleta barw",
            "duży i wygodny wyświetlacz",
            "duży wybór bezpłatnych aplikacji",
            "trzeba",
            "funkcjonalność",
            "niebieska obudowa",
            "niezłe zdjęcia",
            "płynność",
            "płynny i stabilny system",
            "prosta i logiczna obsłługa",
            "prostota i intuicyjność obsługi",
            "responsywność",
            "sprawny",
            "stabilność",
            "system windows 8.1",
            "szybki system",
            "świetna bateria",
            "wejście na karty",
            "windows phone - system na lata",
            "wm8.1",
            "wsparcie producenta",
            "wydajna w grach",
            "wyświetlacz ips",
            "wyświetlacz odporny na zadrapania",
            "zdejmowana tylna klapka",
            "zdjęcia dobrej jakości",
            "zdjęcia w porzadku jak za to cenę",
            "zintegrowane usługi microsoftu"
        ],
        "cons": [],
        "upvote": "2",
        "downvote": "1",
        "posted": "2016-03-19 19:36:32",
        "purchased": null
    },
    {
        "id": "5126849",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Lumia win 10 2 lata zero problemów jak najbardziej do dalszego użytkowania .",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-10-14 11:47:06",
        "purchased": null
    },
    {
        "id": "3299753",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "czy Aero działa w tym modelu? jeśli tak to jak się konfiguruje?",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "0",
        "posted": "2015-08-30 14:18:26",
        "purchased": null
    },
    {
        "id": "5145810",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "ten telefon jest fajny i ma fajny niebieski  100/100",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-10-20 20:36:18",
        "purchased": null
    },
    {
        "id": "3953750",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4/5",
        "content": "Bardzo dobry produkt za tak male pieniądze.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-09-15 21:11:40",
        "purchased": null
    },
    {
        "id": "3352815",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "ok",
        "pros": [
            "doskonała paleta barw",
            "szybki system"
        ],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2015-10-05 19:05:04",
        "purchased": null
    },
    {
        "id": "3289498",
        "author": "Wiktor",
        "recommendation": null,
        "stars": "5/5",
        "content": "Najlepszy telefon w tej cenie.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "1",
        "posted": "2015-08-23 14:34:18",
        "purchased": null
    },
    {
        "id": "3413561",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "Gut 😊",
        "pros": [],
        "cons": [],
        "upvote": "1",
        "downvote": "0",
        "posted": "2015-11-11 21:45:04",
        "purchased": null
    },
    {
        "id": "4055997",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "1/5",
        "content": "Nie polecam. Ogólnie tel spoko ale brak aplikacji na windows to jakaś porażka... Aha a jak aplikacje juz sa to nie sa aktualizowane i nie działają tak jak powinny.",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-10-15 19:29:30",
        "purchased": null
    },
    {
        "id": "7912838",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "4,5/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2018-05-04 10:23:02",
        "purchased": null
    },
    {
        "id": "6417851",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4/5",
        "content": "4,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-12-31 16:48:08",
        "purchased": null
    },
    {
        "id": "4807692",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-06-30 16:40:28",
        "purchased": null
    },
    {
        "id": "4331956",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4/5",
        "content": "4,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2017-01-05 12:29:04",
        "purchased": null
    },
    {
        "id": "4288819",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-12-15 17:41:11",
        "purchased": null
    },
    {
        "id": "3899018",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-08-24 10:42:26",
        "purchased": null
    },
    {
        "id": "3812316",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "4,5/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-07-07 09:01:46",
        "purchased": null
    },
    {
        "id": "3732896",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-05-07 20:42:21",
        "purchased": null
    },
    {
        "id": "3729399",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-05-05 15:35:08",
        "purchased": null
    },
    {
        "id": "4143531",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "0,5/5",
        "content": "Zacina,sie kapa zdjecia",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-11-02 18:37:42",
        "purchased": null
    },
    {
        "id": "3616411",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-03-02 17:13:53",
        "purchased": null
    },
    {
        "id": "3611057",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-02-29 17:14:00",
        "purchased": null
    },
    {
        "id": "3558815",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "4,5/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2016-01-30 15:57:14",
        "purchased": null
    },
    {
        "id": "3486285",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "4,5/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-12-20 13:30:11",
        "purchased": null
    },
    {
        "id": "3477417",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-12-16 00:09:50",
        "purchased": null
    },
    {
        "id": "3430952",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-11-21 16:37:23",
        "purchased": null
    },
    {
        "id": "3374058",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "4,5/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-10-20 07:45:09",
        "purchased": null
    },
    {
        "id": "3371461",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-10-17 15:43:41",
        "purchased": null
    },
    {
        "id": "3288819",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "4,5/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-08-22 16:57:22",
        "purchased": null
    },
    {
        "id": "3240810",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "4,5/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-07-18 15:24:53",
        "purchased": null
    },
    {
        "id": "3217491",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-07-01 16:52:39",
        "purchased": null
    },
    {
        "id": "3207169",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "4,5/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-06-24 14:48:12",
        "purchased": null
    },
    {
        "id": "3201360",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-06-21 15:38:53",
        "purchased": null
    },
    {
        "id": "3200130",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-06-19 19:39:36",
        "purchased": null
    },
    {
        "id": "3195226",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-06-16 19:04:45",
        "purchased": null
    },
    {
        "id": "3178579",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-06-05 17:26:01",
        "purchased": null
    },
    {
        "id": "3178486",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-06-05 15:41:19",
        "purchased": null
    },
    {
        "id": "3176620",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-06-04 00:15:25",
        "purchased": null
    },
    {
        "id": "3169435",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4,5/5",
        "content": "4,5/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-05-30 14:14:36",
        "purchased": null
    },
    {
        "id": "3163927",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-05-27 17:35:20",
        "purchased": null
    },
    {
        "id": "3157154",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-05-23 12:44:28",
        "purchased": null
    },
    {
        "id": "3157149",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-05-23 12:39:35",
        "purchased": null
    },
    {
        "id": "3150075",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "5/5",
        "content": "5,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-05-19 20:34:35",
        "purchased": null
    },
    {
        "id": "3088745",
        "author": "Użytkownik Ceneo",
        "recommendation": null,
        "stars": "4/5",
        "content": "4,0/5",
        "pros": [],
        "cons": [],
        "upvote": "0",
        "downvote": "0",
        "posted": "2015-04-11 19:21:43",
        "purchased": null
    }
]